{
  "week": 6,
  "cached_at": "2025-10-14T13:29:10.875503",
  "record_count": 379,
  "data": [
    {
      "player_name": "Bam Knight",
      "team": "ARI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Knight went into the game set for lead-back duties, but he outpaced backfield mate Michael Carter by only two carries when all was said and done. Knight did record a one-yard touchdown run late in the first quarter and had a nice gain on his one reception, but it's likely the two backs continue in a close timeshare during a Week 7 home matchup against a talented Packers defense.",
      "updated_at": "2025-10-14 18:29:10.860402"
    },
    {
      "player_name": "Emari Demercado",
      "team": "ARI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "Demercado went to the locker room with a slight limp while favoring his left ankle in the second quarter. He's part of a backfield committee for the Cardinals along with Michael Carter and Bam Knight with James Conner (foot) and Trey Benson (knee) on injured reserve. Demercado had one carry for one yard and didn't haul in his only target prior to his exit.",
      "updated_at": "2025-10-14 18:29:10.860403"
    },
    {
      "player_name": "Jacoby Brissett",
      "team": "ARI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Brissett was called on for the first of what could be multiple starts due to Kyler Murray's foot injury, and the veteran signal-caller delivered in signature fashion. Brissett started slowly but picked up steam despite losing Marvin Harrison to a concussion, leaning heavily on Zay Jones, Trey McBride and Michael Wilson throughout the afternoon. The veteran signal-caller hit McBride and Greg Dortch from one and 12 yards out, respectively for his pair of touchdowns, and he had Arizona in position to take the lead after marching his team 78 yards in 10 plays before a fourth-down incompletion on a play where there may have been some pass interference on McBride. Murray could remain out for a Week 7 home matchup against the Packers,  a development that would tee up Brissett for another start",
      "updated_at": "2025-10-14 18:29:10.860402"
    },
    {
      "player_name": "Kedon Slovis",
      "team": "ARI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Slovis will provide extra depth at quarterback, as Kyler Murray (foot) is considered to be a game-time decision for Sunday's matchup against the Colts. If Murray doesn't play, Slovis would serve as the team's backup behind Jacoby Brissett.",
      "updated_at": "2025-10-14 18:29:10.860403"
    },
    {
      "player_name": "Kyler Murray",
      "team": "ARI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Foot",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860400"
    },
    {
      "player_name": "Marvin Harrison Jr.",
      "team": "ARI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Concussion",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860403"
    },
    {
      "player_name": "Michael Carter",
      "team": "ARI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Prior to the game, it was announced that Bam Knight would serve in the lead-back role, theoretically relegating Carter to complementary duties. However, Carter ended up lagging just two carries behind Knight while equaling his teammate's rushing yardage, and he provided a nice chunk play as a receiver with a 16-yard catch. Although Knight did score a short rushing touchdown, the gap between the two players doesn't seem to be much heading into a Week 7 home matchup against the Packers next Sunday afternoon.",
      "updated_at": "2025-10-14 18:29:10.860402"
    },
    {
      "player_name": "Michael Wilson",
      "team": "ARI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Wilson stepped into a bigger role despite dealing with a finger injury, as Marvin Harrison exited the contest due to a concussion in the second quarter. Wilson's target total was his second highest of the season, while both his catch and yardage tallies represented new high-water marks on the campaign. The third-year wideout may also have benefitted from Jacoby Brissett being under center in place of Kyler Murray (foot), and that same arrangement may hold for a Week 7 home matchup against the Packers next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860402"
    },
    {
      "player_name": "Travis Vokolek",
      "team": "ARI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Neck",
      "description": "Vokolek was carted off the field after going down on a Colts kickoff. The 27-year-old is primarily a special teams player and has played just 32 offensive snaps through the first six weeks of the campaign.",
      "updated_at": "2025-10-14 18:29:10.860403"
    },
    {
      "player_name": "Trey McBride",
      "team": "ARI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McBride finished as the Cardinals' leader in receptions and targets and checked in just behind Zay Jones in receiving yards while working with Jacoby Brissett as his quarterback in the absence of Kyler Murray (foot). The veteran tight end's reception and yardage totals also were new season highs, and his target tally tied a high-water mark he'd reached two games prior against the Seahawks. Despite the superior production and his second TD catch of the season, McBride's day ended in frustration when he didn't get a pass interference call in the end zone he felt was warranted on the Cardinals' final play of the contest, a pass that fell incomplete. With talk of a potential multi-game absence for Murray, McBride's evident chemistry with Brissett is encouraging heading into a daunting Week 7 home matchup against the Packers next Sunday afternoon.",
      "updated_at": "2025-10-14 18:29:10.860402"
    },
    {
      "player_name": "Xavier Weaver",
      "team": "ARI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Weaver served as the Cardinals' No. 4 wideout in Week 4 against the Seahawks, before ultimately being inactive in Week 5 against the Titans. The 24-year-old is once again inactive for Sunday's matchup.",
      "updated_at": "2025-10-14 18:29:10.860403"
    },
    {
      "player_name": "Zay Jones",
      "team": "ARI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jones was the Cardinals' surprise leader in receiving yards while checking in second in both receptions and targets. The combination of Marvin Harrison's second-quarter exit due to a concussion and Jacoby Brissett drawing a spot start in place of Kyler Murray (foot) appear to have conspired to generate Jones' season-best performance, as the veteran receiver had come into the afternoon with just a 5-37-0 receiving line on seven targets through four games. If Harrison remains sidelined for next Sunday's Week 7 home game against the Packers, Jones could enjoy an expanded role again versus Green Bay.",
      "updated_at": "2025-10-14 18:29:10.860401"
    },
    {
      "player_name": "Bijan Robinson",
      "team": "ATL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Fresh off of recording a new career high in total yardage (181) in the Falcons' last win, Robinson wasted no time setting a new high-water mark with 238 yards from scrimmage against the Bills. The majority of the fantasy star's production came on the ground this time around, with Monday's 170 rushing yards representing another career best. Robinson is providing a whopping 164.4 combined yards per game for his managers this season. To put that into perspective, the Texas product averaged 111.0 total yards per game over the course of his breakout fantasy campaign in 2024. Robinson's domination of opposing defenses should continue Week 7 against a 49ers defense that will be without star players Fred Warner (ankle) and Nick Bosa (knee).",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Casey Washington",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Washington caught three of six targets for 33 yards while playing 95 percent of Atlanta's offensive snaps during Week 1. Since then, his role has diminished. He missed Weeks 2 and 3 due to a concussion and caught one of three targets for 19 yards while playing 52 percent of the offensive snaps during his return in Week 4. Coming off a Week 5 bye, Washington saw more playing time in Week 6, likely due to Darnell Mooney (hamstring) being unavailable, and finished second among WRs in snaps behind Drake London. However, Washington finished with a season-low two targets and failed to catch a pass for the first time this season, save for the games he was inactive. As long as Mooney is dealing with an injury, Washington is a candidate for heavy snaps, but he's yet to take advantage of the opportunity.",
      "updated_at": "2025-10-14 18:29:10.860404"
    },
    {
      "player_name": "Darnell Mooney",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860404"
    },
    {
      "player_name": "Deven Thompkins",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thompkins will get a chance to provide depth at wide receiver for the Falcons on Monday, with Darnell Mooney (hamstring) ruled out. Across seven regular-season appearances with the Panthers in 2024, Thompkins secured all four of his targets for 20 receiving yards while also contributing in the return game. He'll revert to Atlanta's practice squad after Monday's contest.",
      "updated_at": "2025-10-14 18:29:10.860406"
    },
    {
      "player_name": "Drake London",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was the Bijan Robinson and Drake London Show on Monday Night Football after the two budding superstars accounted for 396 of Atlanta's 443 yards of offense. The 23-year-old London didn't cool off over his team's Week 5 bye, bookending the break with a pair of 100-plus yard games with a touchdown scored in each. He actually finished the contest as the only wide receiver to record a catch for Atlanta, highlighting his status as QB Michael Penix's unquestioned No. 1 target. A red-hot London will set his sights on a battered 49ers defense Week 7.",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Feleipe Franks",
      "team": "ATL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Coming into Monday Night Football, Franks had played only four offensive snaps through four games and hadn't come close to touching the ball. However, in the second quarter against the Bills, Franks entered the game at QB during a third-and-one play, took the snap and got two yards in Atlanta's version of the Tush Push. He also got the Bills to jump offside later in the game in a similar situation. Franks started his career as a QB but has since transitioned to being a special-teams ace and a depth TE. His fantasy value remains non-existent, but he could siphon a touchdown or two if he starts getting Tush Push looks at the goal line.",
      "updated_at": "2025-10-14 18:29:10.860404"
    },
    {
      "player_name": "KhaDarel Hodge",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "A groin injury prevented Hodge from playing against the Commanders in Week 4. With the Falcons on their bye for Week 5, Hodge had an additional week to rest and recover from his injury, and he has been cleared to make his return Monday after logging a full practice Saturday. Hodge has seen the field on both offense and special teams this year, but he has zero receptions on one target through three regular-season games.",
      "updated_at": "2025-10-14 18:29:10.860406"
    },
    {
      "player_name": "Kyle Pitts Sr.",
      "team": "ATL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pitts followed up his best performance of the season against the Commanders (5-70-1) with his lowest fantasy score to date on Monday Night Football. Michael Penix was keyed in on Drake London (10-158-1) and Bijan Robinson (6-68-0) in the passing game, leaving scraps for Pitts and the rest of Atlanta's auxiliary options. Pitts still carries a modest 23-223-1 receiving line into a Week 7 road tilt against the 49ers on Sunday.",
      "updated_at": "2025-10-14 18:29:10.860404"
    },
    {
      "player_name": "Michael Penix Jr.",
      "team": "ATL",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Penix outdueled Bills star QB Josh Allen (57.7 completion percentage for 180 yards) on the national stage en route to the Falcons' third win of the campaign. Bijan Robinson stole the show on offense with 238 yards from scrimmage, but Atlanta's signal-caller also deserves praise for the upset victory. Penix led an impressive 14-play drive midway through the fourth quarter that ate up most of the remaining clock while deflating Buffalo's hopes of a comeback. The surging sophomore will look to build on a modest two-game win streak when the Falcons take on the 49ers in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Nathan Carter",
      "team": "ATL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Once again, the Falcons will go with just two running backs on the gameday roster, as Bijan Robinson and Tyler Allgeier will handle all backfield duties.",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Ray-Ray McCloud III",
      "team": "ATL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Even with Darnell Mooney (hamstring) ruled out, McCloud will be a healthy inactive against Buffalo. It's pretty surprising considering the Falcons' lack of proven wide receivers behind Drake London, but Atlanta will roll with Casey Washington, David Sills, KhaDarel Hodge and Jamal Agnew behind London versus Buffalo.",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Teagan Quitoriano",
      "team": "ATL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Quitoriano has been active as the Falcons' No. 3 tight end through each of the first four games of the season but has seen just as much playing time on special teams as offense. He has yet to draw a target and will continue to function mostly as a blocker when he takes the field with the offense.",
      "updated_at": "2025-10-14 18:29:10.860406"
    },
    {
      "player_name": "Tyler Allgeier",
      "team": "ATL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Allgeier got involved in the box score early with a 21-yard touchdown scamper on Atlanta's opening possession. The talented backup then took a back seat to starter Bijan Robinson, who ripped apart Buffalo's defense to the tune of 238 yards and a score of his own. Allgeier has generated some flex appeal after hitting pay dirt thrice over his last four appearances. There is a four-yard dud nestled in between, so fantasy managers should also be aware of Allgeier's drastic floor ahead of Sunday's tilt against San Francisco.",
      "updated_at": "2025-10-14 18:29:10.860405"
    },
    {
      "player_name": "Cooper Rush",
      "team": "BAL",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Rush drew his second straight start in the absence of Lamar Jackson (hamstring). He ran a decent first possession that resulted in a field goal, completing both of his passes for 12 yards while also scrambling for seven. However, he was intercepted on Baltimore's following drive and the team had several additional miscues before Rush was finally pulled after losing a fumble deep in Rams territory late in the third quarter. Jackson is expected back in Week 8 following Baltimore's bye, and Rush could be in danger of being demoted to the third-string quarterback.",
      "updated_at": "2025-10-14 18:29:10.860407"
    },
    {
      "player_name": "DeAndre Hopkins",
      "team": "BAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Baltimore's passing game was limited under the direction of Cooper Rush and Tyler Huntley on Sunday, but an underlying detail from the game was Hopkins' playing time ticking up. Hopkins played a season-high 26 snaps, which was good for 33 percent of the plays. He also had a season-high four targets. Baltimore is on a bye in Week 7, but given that Hopkins has been excellent on a per-target basis (13.7 YPT), it would not be surprising to see his role continue on an upward trend, especially when Lamar Jackson returns.",
      "updated_at": "2025-10-14 18:29:10.860406"
    },
    {
      "player_name": "Derrick Henry",
      "team": "BAL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Ravens' offensive game plan was to feed Henry as much as possible, limiting the need for Cooper Rush to take to the air. That was effective in the first half, as Henry delivered 18 carries for 90 yards while Baltimore also controlled time of possession. Game script ultimately got away from the team, but this was a needed performance from Henry, both in terms of volume and efficiency. He recorded three rushes of more than 10 yards to top 50 yards for the first time since Week 1. Henry's 25 touches were also his most of the campaign, and he should benefit from the expected return of Lamar Jackson (hamstring) in Week 8, following the team's bye.",
      "updated_at": "2025-10-14 18:29:10.860408"
    },
    {
      "player_name": "Devontez Walker",
      "team": "BAL",
      "position": "WR",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Oblique",
      "description": "out",
      "updated_at": "2025-10-14 18:29:10.860407"
    },
    {
      "player_name": "Justice Hill",
      "team": "BAL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Ravens ran a run-heavy offense as long as possible, giving Hill a chance to mix in on possessions to relieve Derrick Henry. Hill saw a season-high six carries as a result, but he made a more significant impact as a pass catcher. His usage could change with the anticipated return of Lamar Jackson (hamstring) after the team's bye, but Hill has at least three catches in four of six games on the campaign.",
      "updated_at": "2025-10-14 18:29:10.860407"
    },
    {
      "player_name": "Lamar Jackson",
      "team": "BAL",
      "position": "QB",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "Jackson has missed Baltimore's last two games, but Harbaugh indicated Sunday that his hope and expectation is that the star QB will be available for the team's Oct. 26 game against the Bears. The looming return of Jackson, among others, in Week 8 offers hope that a turnaround can be engineering by the Ravens, who head into their bye week with a 1-5 record. Either way, if Jackson is healthy, he belongs in fantasy lineups.",
      "updated_at": "2025-10-14 18:29:10.860408"
    },
    {
      "player_name": "Mark Andrews",
      "team": "BAL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The positive for Andrews was that he remained involved in the Baltimore offense, finishing tied for second on the team in targets. He was unable to convert that into much production while catching passes from the combination of Cooper Rush and Tyler Huntley, with his longest gain going for only nine yards. The outlook for all Ravens pass catchers should improve with the anticipated return of Lamar Jackson (hamstring) in Week 8 following the team's bye, though Andrews could lose out on opportunity to more explosive options such as Rashod Bateman and Isaiah Likely.",
      "updated_at": "2025-10-14 18:29:10.860407"
    },
    {
      "player_name": "Rashod Bateman",
      "team": "BAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Lamar Jackson's absence continued to be a massive limiting factor on the Baltimore passing game Sunday. However, Bateman's involvement waned a bit Sunday as he played just 56 percent of the snaps, a season-low. His cold stretch precedes Jackson's absence, too. His best game thus far was five catches for 63 yards and a score against the Lions in Week 3. Outside of that game, Bateman has six catches for 57 yards on the year. The Ravens are on a bye in Week 7, and the hope is that the impending Jackson return will revitalize the floundering Baltimore offense.",
      "updated_at": "2025-10-14 18:29:10.860406"
    },
    {
      "player_name": "Zaire Mitchell-Paden",
      "team": "BAL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "One of four tight ends the Ravens made active in Week 5, Mitchell-Paden finished last among the quartet in offensive snap share (28 percent), but he was able to come away with his first NFL reception across his 12 plays. Listed at 6-foot-5 and 257 pounds, Mitchell-Paden brings most of his value to the Ravens as a blocker and as a core special-teams player, so he's unlikely to command much target volume even if Baltimore were to lose Mark Andrews, Isaiah Likely and/or Charlie Kolar for any period of time.",
      "updated_at": "2025-10-14 18:29:10.860408"
    },
    {
      "player_name": "Zay Flowers",
      "team": "BAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Flowers was targeted heavily by the combination of Cooper Rush and Tyler Huntley, with no other Baltimore pass catcher earning more than six targets. He had long gains of 18 and 10 yards, though the latter was undone when he fumbled on the same play. Flowers has been mediocre from a fantasy perspective in the absence of Lamar Jackson (hamstring) despite consistent volume in the offense. However, he should be in line for more explosive performances with Jackson expected back in Week 8 following Baltimore's bye.",
      "updated_at": "2025-10-14 18:29:10.860407"
    },
    {
      "player_name": "Curtis Samuel",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Neck",
      "description": "Samuel was initially listed as questionable for Monday's matchup after logging a LP-DNP-LP practice slate, but he ultimately won't go. With Buffalo set to benefit from a Week 7 bye, Samuel will have extra time to get healthy and work to get back on the field Week 8 versus the Panthers on Sunday, Oct. 26. With Samuel sidelined, Keon Coleman, Khalil Shakir and Joshua Palmer are in line to lead the Bills' Week 6 WR corps, while Brandon Codrington and Ty Johnson will operate as the team's top kick returners.",
      "updated_at": "2025-10-14 18:29:10.860410"
    },
    {
      "player_name": "Dalton Kincaid",
      "team": "BUF",
      "position": "TE",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Oblique",
      "description": "Kincaid, who opened the practice week Thursday sporting a non-contact jersey, subsequently was deemed limited in all three sessions before being listed as questionable for Monday's contest. Now that he's been ruled out versus Atlanta, Dawson Knox is in line to lead the Bills' Week 6 TE corps, with Jackson Hawes available to mix in. Kincaid will target a potential return to action Sunday, Oct. 26 against the Panthers following Buffalo's bye week.",
      "updated_at": "2025-10-14 18:29:10.860410"
    },
    {
      "player_name": "Dawson Knox",
      "team": "BUF",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The veteran tight end rose to the top of the depth chart Monday night due to Dalton Kincaid (oblique) being inactive, but Knox ultimately garnered a minimal amount of Josh Allen's attention. Nevertheless, Knox made good on his one opportunity, getting into the end zone with 8:01 remaining in the first quarter to erase an early 7-0 deficit. The score was Knox's first since Week 6 of last season, but his run as the No. 1 option at the position may be limited to just Monday's game since Kincaid figures to have a good chance of getting healthy over Buffalo's Week 7 bye.",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "Elijah Moore",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Moore was healthy inactive in the Week 5 Sunday night loss to New England, but with Curtis Samuel (neck) out Monday night, Moore will draw back into the lineup. Moore has four catches for 64 scoreless yards this season.",
      "updated_at": "2025-10-14 18:29:10.860410"
    },
    {
      "player_name": "Jackson Hawes",
      "team": "BUF",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With fellow tight end Dalton Kincaid (oblique) inactive for the first time in 2025, Hawes played a season-high 54 percent of the Bills' offensive snaps. However, the uptick in playing time didn't translate to any looks in the passing game for Hawes, with Dawson Knox drawing both of the targets on the night among Buffalo tight ends. Through his first six games, Hawes has produced a 4-54-1 receiving line on four targets.",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "James Cook III",
      "team": "BUF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Cook enjoyed a solid night on the ground despite game script working against the run as the game unfolded, bouncing back nicely from a 49-yard showing in the Week 5 loss to the Patriots. However, he failed to draw a target for the first time this season after not hauling in the one pass thrown his way Week 5, a relatively rare slump for him as a pass catcher. Cook's fantasy value remains significantly elevated in all formats, however, and he draws a favorable matchup on the road against the Panthers on Sunday, Oct. 26 following Buffalo's Week 7 bye.",
      "updated_at": "2025-10-14 18:29:10.860410"
    },
    {
      "player_name": "Josh Allen",
      "team": "BUF",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Allen's final line tells the tale of a difficult night against a well-rested and aggressive Falcons defense fueled by its home crowd. Despite his signature mobility, Allen was sacked four times, and he also tossed multiple interceptions for the first time this season, including a game-sealing pick at Atlanta's 7-yard line with 51 seconds remaining. The reigning NFL MVP's yardage total also was his second lowest of the season, and the fact he went into the contest without Dalton Kincaid (oblique) and Curtis Samuel (neck/ribs) before also losing Joshua Palmer to an ankle injury in the first half certainly didn't help Allen's cause. Buffalo now gets a much-needed bye following back-to-back losses before returning to action against the Panthers in Carolina on Sunday, Oct. 26.",
      "updated_at": "2025-10-14 18:29:10.860410"
    },
    {
      "player_name": "Joshua Palmer",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "Keon Coleman",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Coleman tied for the team lead in receptions and targets, but as his final line indicates, those opportunities were essentially for naught. The second-year wideout has endured an underwhelming season that's included a Week 5 benching for that game's opening series, and Coleman notably couldn't make an impact Monday despite the Bills being without Dalton Kincaid (oblique) and Curtis Samuel (neck/ribs) to begin the game and then losing Joshua Palmer (ankle) during the contest. Coleman and quarterback Josh Allen will have a Week 7 bye to work on their chemistry before returning to action Oct. 26 on the road against the Panthers.",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "Khalil Shakir",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Shakir had an acrobatic catch overturned by replay in the first quarter, and he otherwise had a quiet night despite tying for the team lead in receptions and targets. The fourth-year wideout had come into Monday on a reasonably productive run in which he produced a 11-124-1 receiving line on 14 targets over the prior pair of contests. He'll face a tough challenge against the talented Panthers secondary when the Bills take on Carolina on the road following their Week 7 bye.",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "Ray Davis",
      "team": "BUF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Davis played a total of two offensive snaps and was targeted by Josh Allen in the passing game on both of those plays. His 16-yard touchdown on the opening drive of the second half pulled the Bills within seven points, but Buffalo was unable to score the rest of the way. Despite finding paydirt for the first time all season, Davis continues to struggle to earn meaningful run behind starting running back James Cook. Davis has played single-digit snaps in four straight games, with passing-down specialist Ty Johnson receiving more playing time than Davis in all of those contests. Though Davis could be the preferred option over Johnson to lead the Bills' rushing attack if Cook were to miss time at any point, Davis will likely continue to handle a light role so long as Cook is healthy.",
      "updated_at": "2025-10-14 18:29:10.860408"
    },
    {
      "player_name": "Ty Johnson",
      "team": "BUF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "For the fourth straight game, Johnson outpaced Ray Davis in playing time, with the latter running back being limited to just two snaps while the former logged 24, his most since Week 1. Starter James Cook still led the backfield with 30 snaps on the night, though he was limited to just one carry in the fourth quarter while the Bills largely abandoned the run and leaned more heavily on Johnson in passing situations. The Bills seemingly view Johnson mainly as a passing-down specialist, and even if Cook were to miss time at some point after the team's Week 7 bye, Davis could still garner a good portion of the carries out of the backfield.",
      "updated_at": "2025-10-14 18:29:10.860408"
    },
    {
      "player_name": "Tyrell Shavers",
      "team": "BUF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With two pass catchers in Curtis Samuel (neck/ribs) and Dalton Kincaid (oblique) inactive for the Week 6 contest and with another in Joshua Palmer (ankle) exiting the contest early, Shavers benefited from an expanded profile in the Buffalo offense. The third-year wideout out of San Diego State hadn't taken the field for more than one-third of Buffalo's offensive plays in any of the first five weeks and drew a combined five targets over that stretch, but he logged nearly half of the snaps Monday and finished one behind Keon Coleman for the team lead in targets. Despite the modest spike in production, Shavers is likely to see his role get downsized if Buffalo is able to reclaim some health in its pass-catching corps coming out of a Week 7 bye.",
      "updated_at": "2025-10-14 18:29:10.860409"
    },
    {
      "player_name": "Bryce Young",
      "team": "CAR",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Young's yardage total was far from scintillating, but the third-year signal-caller kept his team competitive throughout a back-and-forth affair against Dak Prescott and his high-powered offense. Young did his part with a trio of touchdown tosses, two which went to rookie wideout Tetairoa McMillan from 19 and two yards out, respectively. Young also connected with Rico Dowdle for a 36-yard strike early in the third quarter, tying Young's single-game high for TD passes this season. The 2023 first overall pick has now been under 200 passing yards in four consecutive contests, but he'll carry the momentum of a season-best 68.0 percent completion rate into a Week 7 road matchup against the Jets.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Brycen Tremayne",
      "team": "CAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tremayne was held without a reception for the first time since Week 1, ending a four-game stretch in which he accrued a 9-108-0 receiving line on 12 targets. Though he still finished third among Carolina wideouts in snap share (34 percent), Tremayne is likely to see his playing time take a hit if Jalen Coker (quadriceps) is reinstated from injured reserve ahead of the Panthers' next game Sunday at the Jets.",
      "updated_at": "2025-10-14 18:29:10.860411"
    },
    {
      "player_name": "Chuba Hubbard",
      "team": "CAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Calf",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860412"
    },
    {
      "player_name": "DeeJay Dallas",
      "team": "CAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "For the second straight week, Dallas suited up as the Panthers' No. 3 running back behind Rico Dowdle and Trevor Etienne while Chuba Hubbard (calf) remained sidelined. Dallas ended up playing four snaps on offense -- just four fewer than Etienne -- but Dowdle once again dominated the playing time while accounting for 34 of the 38 touches from the Carolina backfield. If Hubbard returns for the Panthers' Week 7 game against the Jets, Carolina will likely keep just one of Dallas and Etienne active for the contest, with either running back expected to see most of his playing time on special teams.",
      "updated_at": "2025-10-14 18:29:10.860411"
    },
    {
      "player_name": "Hunter Renfrow",
      "team": "CAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Although Renfrow underwhelmed again in the Week 6 win, his only catch came on a crucial fourth-down conversion late in the fourth quarter that helped set up the Panthers' game-winning field goal. The veteran wideout from Clemson has now caught just four of seven targets for 24 yards over Carolina's last three games, and his role is expected to diminish even further once Jalen Coker (quadriceps) returns from injured reserve.",
      "updated_at": "2025-10-14 18:29:10.860412"
    },
    {
      "player_name": "Ja'Tavion Sanders",
      "team": "CAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860411"
    },
    {
      "player_name": "James Mitchell",
      "team": "CAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With top tight end Ja'Tavion Sanders (ankle) inactive for the third game in a row, Mitchell once again suited up as Carolina's No. 3 option at the position behind Tommy Tremble and Mitchell Evans. Mitchell had recorded three catches for 28 yards between the previous two contests, but he failed to garner any looks from quarterback Bryce Young during his limited time on the field Sunday. Mitchell will likely find himself back on the inactive list for the Panthers' Week 7 game against the Jets if Sanders is cleared to return to action.",
      "updated_at": "2025-10-14 18:29:10.860411"
    },
    {
      "player_name": "Jimmy Horn Jr.",
      "team": "CAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The 2025 sixth-round pick from Colorado has been increasingly involved in Carolina's offense over the past two weeks, catching four of his five targets for 57 yards and rushing three times for 21 yards. Horn led all Panthers wideouts in receiving yards during Sunday's win, suggesting he's already carved out a meaningful role in the offense. Although Jalen Coker (quadriceps) is likely returning from injury soon, Horn is expected to be a key part of the Carolina's offensive game plan in a Week 7 matchup against the Jets.",
      "updated_at": "2025-10-14 18:29:10.860412"
    },
    {
      "player_name": "Mitchell Evans",
      "team": "CAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "For the third game in a row, the rookie fifth-round pick out of Notre Dame served as Carolina's No. 2 tight end behind Tommy Tremble while usual starter Ja'Tavion Sanders (ankle) was sidelined once again. Evans had come through with touchdowns in the previous two contests, and though he didn't find paydirt Sunday, his 21-yard catch was the Panthers' third-longest play of the day and helped set up a field goal in the first quarter. Despite making a bit of splash in his backup role the past three games, Evans is still likely to see his playing time take a hit if Sanders is back in action Week 7 against the Jets.",
      "updated_at": "2025-10-14 18:29:10.860411"
    },
    {
      "player_name": "Rico Dowdle",
      "team": "CAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "One week after delivering a career-best 206-yard effort against the Dolphins, Dowdle was blessed with a second straight matchup against a porous defense. In Week 6, that unit happened to be comprised of plenty of his former Cowboys teammates, and Dowdle parlayed the additional incentive into another spectacular afternoon. While he came just short of hitting the 200-yard mark on the ground for the second straight contest, the surging veteran was able to shine as a pass catcher while compiling a team-high receiving yardage total and scoring his first receiving TD of the season on a 36-yard grab to close out the opening possession of the second half. Given Dowdle's production over the last two games, it appears highly unlikely Chuba Hubbard (calf) will be able to reclaim anything close to the snap share he previously enjoyed as the No. 1 back, and the latter doesn't appear likely to be available for a Week 7 road matchup against the Jets next Sunday anyhow.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Tetairoa McMillan",
      "team": "CAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "As his final line indicates, the rookie first-round pick made excellent use of his trio of catches, turning two of them into 19- and two-yard touchdown grabs for the first pair of end-zone trips of his career. Otherwise, McMillan's reception, yardage and target totals all tied or served as new season lows, making it a mixed bag of a day to an extent from a fantasy perspective. Nevertheless, McMillan's role as Carolina's No. 1 receiver is as iron clad as it gets, but he's likely to draw plenty of Sauce Gardner's attention in a Week 7 visit to the Jets next Sunday afternoon.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Tommy Tremble",
      "team": "CAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Notre Dame product served as the Panthers' No. 1 tight end for the third consecutive week while Ja'Tavion Sanders (ankle) remained out with an injury. Tremble capitalized on the opportunity, finishing with the second-most receiving yards on the team during Sunday's win. While Sanders has been sidelined, Tremble has managed to catch 10 of his 14 targets for 88 yards and one touchdown. Although he's impressed with a larger offensive role, Sanders is likely to return for Carolina's Week 7 matchup against the Jets, which is expected to make Tremble a reserve option once again.",
      "updated_at": "2025-10-14 18:29:10.860412"
    },
    {
      "player_name": "Trevor Etienne",
      "team": "CAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie running back from Georgia continued to work in a reserve role, as Rico Dowdle tallied 239 total yards and a touchdown on 34 touches in the Panthers' Week 6 win. Etienne has now rushed 15 times for 76 yards and caught both of his targets for nine yards over his first six games as a pro. He's expected to remain a depth option in Carolina's backfield while operating as the team's kick and punt returner in a Week 7 matchup against the Jets.",
      "updated_at": "2025-10-14 18:29:10.860412"
    },
    {
      "player_name": "Xavier Legette",
      "team": "CAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Since returning from injury in Carolina's Week 5 win over the Dolphins, Legette has been targeted just five times, catching four passes for 42 yards and a touchdown over the team's last two games. He was outpaced by rookie wideouts Tetairoa McMillan (3-39-2) and Jimmy Horn (2-36-0), finishing sixth on the team in receiving yards during Sunday's victory. Although the second-year pro continues to operate as the Panthers' No. 2 wide receiver, his involvement has been limited, with most of the team's offensive production coming from McMillan and Rico Dowdle. Legette draws another great matchup in Week 7 against a struggling Jets defense, but he's still unlikely to make a meaningful fantasy impact.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Caleb Williams",
      "team": "CHI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Williams didn't post gaudy numbers on Monday Night Football, but he played a clean game while lifting the Bears to a third straight victory. The 2024 first-overall pick won the individual battle between the top two quarterback selections from that draft, but Jayden Daniels arguably had the superior fantasy score after hitting pay dirt thrice in a losing effort. Williams has been looking more comfortable running head coach Ben Johnson's offense with each passing week, a trend the duo will look to maintain against the Saints on Sunday.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Case Keenum",
      "team": "CHI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860414"
    },
    {
      "player_name": "Cole Kmet",
      "team": "CHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kmet has 10 or fewer yards in two of his last three games with one game over 31 yards, leaving him as a fantasy depth tight end.",
      "updated_at": "2025-10-14 18:29:10.860414"
    },
    {
      "player_name": "Colston Loveland",
      "team": "CHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Loveland has five receptions this season, and limited usage keeps him a watch-list tight end until his usage increases.",
      "updated_at": "2025-10-14 18:29:10.860414"
    },
    {
      "player_name": "DJ Moore",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Undisclosed",
      "description": "The details surrounding Moore's admission to the hospital are unclear. He briefly spent time in the medical tent in the first half but was back on the field after halftime and well into the fourth quarter. Coach Ben Johnson is expected to provide further details about Moore's status at some point on Tuesday afternoon.",
      "updated_at": "2025-10-14 18:29:10.860415"
    },
    {
      "player_name": "Devin Duvernay",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Though he's been active for every game this season, Duvernay's role has been contained exclusively to special teams. He has yet to log a snap on offense through five contests and is averaging 25.0 yards per kickoff return and 11.4 yards per punt return.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Durham Smythe",
      "team": "CHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smythe has yet to draw a target through five appearances on the season and will continue to be relegated to a limited role as a blocker on offense while fellow tight ends Cole Kmet and Colston Loveland are both available.",
      "updated_at": "2025-10-14 18:29:10.860413"
    },
    {
      "player_name": "Jahdae Walker",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860414"
    },
    {
      "player_name": "Kyle Monangai",
      "team": "CHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Monangai has fewer than 20 rushing yards in three straight contests, but he reached a season-high 25 receiving yards in Week 6, keeping him in a fantasy reserve role.",
      "updated_at": "2025-10-14 18:29:10.860415"
    },
    {
      "player_name": "Luther Burden III",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Burden bounced back nicely from the disappointing two-catch performance we saw prior to Chicago's Week 5 bye. The rookie slot receiver finished with more receiving yards than DJ Moore (42) and Rome Odunze (32) as QB Caleb Williams distributed the ball more evenly amongst his talented group of receivers Monday. Burden's production has fluctuated wildly on a week-to-week basis, making it hard to bank on the rookie's production against the Saints in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860415"
    },
    {
      "player_name": "Olamide Zaccheaus",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Zaccheaus has drawn at least four targets in every game and has two games with at least 40 receiving yards this season. Though he continues to play ahead of rookie Luther Burden as the Bears' No. 3 receiver, Zaccheaus' fantasy utility remains mostly limited to deeper leagues.",
      "updated_at": "2025-10-14 18:29:10.860415"
    },
    {
      "player_name": "Rome Odunze",
      "team": "CHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Chicago's Week 5 bye didn't benefit Odunze, who saw the four-game scoring streak he started the season with end abruptly Monday. The 23-year-old finished fourth for the Bears in receiving as QB Caleb Williams spread the ball around evenly amongst his targets in the win. Odunze was providing WR1 production prior to Monday's dud, so managers should continue starting the wideout with confidence against the Saints on Sunday.",
      "updated_at": "2025-10-14 18:29:10.860415"
    },
    {
      "player_name": "Roschon Johnson",
      "team": "CHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Though Johnson has now suited up four games this season, Monday marked the first time that he's touched the ball in 2025. His role is expected to be contained mostly to special teams while rookie Kyle Monangai serves as the Bears' No. 2 running back behind D'Andre Swift.",
      "updated_at": "2025-10-14 18:29:10.860414"
    },
    {
      "player_name": "Andrei Iosivas",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "So far the Bengals have resisted calls to replace Iosivas with Mitchell Tinsley or Jermaine Burton. Iosivas played 38 snaps last week and hasn't played fewer than 35 snaps in any week, whereas Tinsley was limited to 10 offensive snaps against the Brewers and Burton can't find the field at all.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Cam Grandy",
      "team": "CIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860417"
    },
    {
      "player_name": "Charlie Jones",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ribs",
      "description": "Jones must have injured his ribs in Sunday's loss to the Packers, as he went into that contest battling some Achilles pain before being cleared to play. Jones has logged just four offensive snaps all season but handles kickoff and punt returns for the Bengals. If Jones is unable to play Thursday night against the Steelers, Jermaine Burton could get the call to handle return duties.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Chase Brown",
      "team": "CIN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Brown finally showed some efficiency on the ground thanks primarily to a 13-yard run shortly before halftime. However, his day was defined by a shift in touch allocation in the Cincinnati backfield, with Samaje Perine earning eight total touches to Brown's 11. Game script may have dictated that late in the contest, but Perine drew the Bengals' first carry and recorded only two of his touches when the team was in a hopeless situation on the scoreboard. There's no obvious candidate to fully displace Brown in the Cincinnati backfield,  but this was the team's first signal that it may be growing weary of his lack of efficiency.",
      "updated_at": "2025-10-14 18:29:10.860421"
    },
    {
      "player_name": "Drew Sample",
      "team": "CIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Sample could be in line for more playing time Thursday night, with Mike Gesicki (pectoral) out and Tanner Hudson in the concussion protocol. Sample's primary role is as a blocker, however, so that rise in playing time is unlikely to translate into bankable fantasy production.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Ja'Marr Chase",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Chase got a change in quarterback with Joe Flacco under center, and he logged his highest target total since Joe Burrow (toe) has been sidelined. The Packers did a good job limiting his production for most of the game, though Chase eventually managed to break through for long catches of 12, 18 and 19 yards in the second half, the final of which went for an acrobatic touchdown late in the fourth quarter. The performance gives some hope that Chase will remain a reliable fantasy contributor even in the absence of Burrow, as he has now found the end zone and topped 100 receiving yards in consecutive contests.",
      "updated_at": "2025-10-14 18:29:10.860421"
    },
    {
      "player_name": "Jermaine Burton",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860418"
    },
    {
      "player_name": "Joe Flacco",
      "team": "CIN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Flacco had a quick turnaround after being traded to Cincinnati on Tuesday. Given that and a tough road matchup, he performed relatively well. He led three scoring drives in the second half, highlighted by a two-yard touchdown pass to Tanner Hudson and a 19-yard scoring toss to Ja'Marr Chase. This marked Flacco's first multi-touchdown performance across five starts in 2025, and he should be able to put up respectable numbers with the help of Chase and Tee Higgins.",
      "updated_at": "2025-10-14 18:29:10.860421"
    },
    {
      "player_name": "Mike Gesicki",
      "team": "CIN",
      "position": "TE",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Pectoral",
      "description": "The team is gathering more information on the extent of Gesicki's pectoral injury, but it certainly sounds like he's going to miss multiple games. He's already been ruled out for Week 7 against the Steelers on Thursday night. Gesicki played just two offensive snaps against the Packers before he was injured on the Bengals' opening drive. Tanner Hudson filled in as the primary receiving tight end, securing four of five targets for 10 yards and one touchdown, but Hudson is now in the league's concussion protocol. If both Gesicki and Hudson can't play Thursday, Noah Fant, Drew Sample and Cam Grandy would likely handle tight-end duties.",
      "updated_at": "2025-10-14 18:29:10.860417"
    },
    {
      "player_name": "Mitchell Tinsley",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Meanwhile erstwhile competition Andrei Iosivas played 58 snaps, though he was limited to five yards on one catch. With Mike Gesicki injured, perhaps more targets will be forthcoming to the Bengals' tertiary wideouts.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Noah Fant",
      "team": "CIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Fant saw an uptick in target opportunities with Joe Flacco under center, though his increased workload can also be contextualized by the departure of Mike Gesicki (pectoral) in the second quarter. In the event that Gesicki is unable to suit up Thursday versus the Steelers on a short week of rest, Fant will get a chance to handle No. 1 tight end duties, making him a potential streaming option for fantasy purposes. Notably, reserve tight end Tanner Hudson drew five targets versus Green Bay, securing four of them for 10 receiving yards and a touchdown.",
      "updated_at": "2025-10-14 18:29:10.860417"
    },
    {
      "player_name": "Samaje Perine",
      "team": "CIN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Perine saw a season-high six carries and eight total touches, as he continued to even the workload with Chase Brown. Perine hasn't proven capable of putting up viable fantasy performances to this point, with Sunday representing his highest yardage output. Nevertheless, it will be worth monitoring how touches are distributed in the Cincinnati backfield moving forward.",
      "updated_at": "2025-10-14 18:29:10.860420"
    },
    {
      "player_name": "Tanner Hudson",
      "team": "CIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Concussion",
      "description": "With Mike Gesicki (pectoral) going down on the opening drive against the Packers on Sunday, Hudson played elevated offensive snaps and secured four of five targets for 10 yards and one touchdown. Hudson now is injured and looking unlikely to play Thursday night against the Steelers. If Hudson and Gesicki, who is expected to be out for \"a while,\" can't play against Pittsburgh, Noah Fant, Drew Sample and Cam Grandy would likely handle tight-end duties for the Bengals.",
      "updated_at": "2025-10-14 18:29:10.860416"
    },
    {
      "player_name": "Tee Higgins",
      "team": "CIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "This was far from a standout performance from Higgins, but it did represent his highest reception and yardage totals of the season. He narrowly missed out on a more impressive fantasy showing, as he was dragged down at Green Bay's one-yard line on a 13-yard reception midway through the third quarter. Higgins was evaluated for a concussion due to the tackle on that same play but was cleared to return without missing a full possession. The Cincinnati offense is still likely to be inconsistent, but Joe Flacco prioritized getting the ball to Higgins and Ja'Marr Chase in his Bengals debut, which has improved the outlook for the star pass catchers.",
      "updated_at": "2025-10-14 18:29:10.860421"
    },
    {
      "player_name": "David Njoku",
      "team": "CLE",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee",
      "description": "The Browns initially reported that Njoku was dealing with a thigh issue. Either way, the tight end's status will need to be monitored ahead of next weekend's game against the Dolphins. In the event that Njoku is sidelined further, Harold Fannin would be in line to see added TE targets, with Blake Whiteheart mixing in as well.",
      "updated_at": "2025-10-14 18:29:10.860423"
    },
    {
      "player_name": "Dillon Gabriel",
      "team": "CLE",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Gabriel was constantly under pressure, taking six sacks while averaging only 4.25 yards per attempt. Positively, he did continue to show a connection with fellow rookie tight end Harold Fannin, as the duo connected for a 25-yard gain -- the longest of the day for both Gabriel and the team. Gabriel should have the chance to put together a better performance in Week 7 when the Browns host the Dolphins.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "Dylan Sampson",
      "team": "CLE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Sampson had his highest usage since Week 1, including a turn as the primary kickoff returner. Once Quinshon Judkins was established as the lead back, Sampson's role evaporated. He had just four touches over the last three weeks, while getting single-digit snaps in all three contests.",
      "updated_at": "2025-10-14 18:29:10.860421"
    },
    {
      "player_name": "Gage Larvadain",
      "team": "CLE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Concussion",
      "description": "Larvadain took a hit to the head from DeShon Elliott during the second half of Sunday's game. Larvadain will now enter the league's five-step concussion protocol, and he'll have to be be cleared by an independent neurologist in order to play in Week 7 against the Dolphins on Sunday, Oct. 19. Isaiah Bond would be in line to serve as the Browns' primary punt returner if Larvadain misses time.",
      "updated_at": "2025-10-14 18:29:10.860423"
    },
    {
      "player_name": "Harold Fannin Jr.",
      "team": "CLE",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Fannin continued to showcase rapport with Dillon Gabriel, as he led the Browns in receptions and yards. He did do the majority of his damage with the Steelers playing conservative defense in the fourth quarter, with 56 of Fannin's yards coming with the Browns down multiple scores. Even with that context, the rapport between Fannin and Gabriel is clear, as Fannin has 11 catches for 94 yards and a touchdown combined between the last two games.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "Isaiah Bond",
      "team": "CLE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bond was gaining momentum in the Cleveland offense in recent weeks, but that changed in Sunday's loss. Dillon Gabriel took to the air 52 times, with both Harold Fannin and Jerry Jeudy soaking up targets. Bond was shut out on the stat sheet until early in the fourth quarter and will look to reestablish his role in Week 7 against Miami.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "Jerome Ford",
      "team": "CLE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Ford was on the field for 33 offensive snaps -- the most since Week 2 -- and had seven touches for the second straight week. His playing time has increased the last two games, which is tied to the quarterback change from Joe Flacco to rookie Dillon Gabriel. Ford leads the running back room with 21 targets through six games and could see an uptick in usage as a runner going forward, as the organization seeks to protect the one hopeful thing it has on offense, rookie running back Quinshon Judkins.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "Jerry Jeudy",
      "team": "CLE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jeudy bounced back from a volume perspective in Dillon Gabriel's second career start, as he led the team in targets in Sunday's loss. However, the good news ended there, as Jeudy managed an abysmal 3.3 yards per target with a long reception of only 12 yards. Things haven't gone well between Gabriel and Jeudy early on, as Jeudy has only seven catches for 58 yards on 18 targets through Gabriel's first two starts.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "Malachi Corley",
      "team": "CLE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Corley upgraded to full participation Friday following a pair of limited practices. The 2024 third-round draft pick of the Jets played 12 snaps on offense in his Browns debut against the Vikings this past Sunday in London, turning his only touch into an 11-yard carry.",
      "updated_at": "2025-10-14 18:29:10.860423"
    },
    {
      "player_name": "Quinshon Judkins",
      "team": "CLE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Browns fell behind early in the game and took to the air 52 times in a comeback effort. That limited Judkins' opportunity, and he also lost out on touches to Jerome Ford as a pass catcher. Judkins also suffered from an efficiency perspective, with his longest gain of the day going for only six yards. The Browns should be in a more neutral game script in Week 7 against Miami, so Judkins is likely to be in for a bounce-back performance.",
      "updated_at": "2025-10-14 18:29:10.860423"
    },
    {
      "player_name": "Raheim Sanders",
      "team": "CLE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The undrafted rookie played three snaps on offense during the Browns' Week 1 loss to the Bengals but has not played since. The Browns will go with a three-man backfield of Quinshon Judkins, Jerome Ford and Dylan Sampson for Sunday's AFC North tilt.",
      "updated_at": "2025-10-14 18:29:10.860423"
    },
    {
      "player_name": "Shedeur Sanders",
      "team": "CLE",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Browns were unable to create much offensively, but that did not fall solely on Gabriel, who was sacked six times and absorbed another 16 hits. Injuries along the offensive line also limited the rushing attack, and Cleveland's pass-catchers dropped multiple passes. It's unlikely Sanders could have changed the trajectory of the game, but Stefanski could only list the things to fix on a broken offense (13.67 ppg) with no easy solution. The organization will still likely need to see what it has in Sanders before entering the offseason, but Gabriel appears set for a long look in the starting role before that happens.",
      "updated_at": "2025-10-14 18:29:10.860422"
    },
    {
      "player_name": "CeeDee Lamb",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860424"
    },
    {
      "player_name": "Dak Prescott",
      "team": "DAL",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Prescott continued his excellent season, throwing for three or more touchdowns in his third straight game while also surpassing 250 passing yards for the fourth time in six contests on the campaign. He showed an ongoing strong connection with George Pickens, connecting with him for three gains of more than 30 yards, including scores from 45 and 34 yards away. Prescott's outlook could improve further in Week 7 due to the potential return of CeeDee Lamb (ankle), though Prescott has proven plenty capable of producing without one of his star pass catchers.",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "George Pickens",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pickens accounted for all three of Dallas' longest plays from scrimmage, recording catches of 45, 34 and 31 yards. That production came in a variety of ways, as he served in his more traditional deep-threat role but also showcased his athleticism with hurdles and jukes to elude defenders. Pickens' touchdown came on a slant route over the middle of the field, and he out-raced defenders for a 34-yard score. He has at least one touchdown in five straight games and now has over 100 receiving yards in consecutive games, stepping up very well in the absence of CeeDee Lamb (ankle).",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "Jake Ferguson",
      "team": "DAL",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Ferguson saw a season-low three targets, with Ryan Flournoy joining George Pickens and Javonte Williams as Dak Prescott's favorite targets. Ferguson was productive with the opportunity he saw, hauling in a 19-yard touchdown just before halftime. He has a touchdown in three straight games, though he could become more reliant upon efficiency with CeeDee Lamb (ankle) potentially in line for a Week 7 return.",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "Jalen Cropper",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The move corresponds with the Cowboys placing running back Miles Sanders (knee) on injured reserve. Cropper had been elevated from the practice squad to the active roster twice this season and played a season-high six snaps on offense during the Cowboys' Week 5 win over the Jets. The third-year wideout will likely see most of his playing time Sunday on special teams but could get some work on offense due to the absences of fellow wideouts CeeDee Lamb (ankle) and KaVontae Turpin (foot).",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "Jalen Tolbert",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "While the fourth-year wideout saw a 91 percent snap share on offense, that didn't translate into any kind of meaningful pass volume for a second straight contest, as Ryan Flournoy (9-144-0 in 15 targets in those two games) has clearly surpassed Tolbert as a trusted target for Dak Prescott. Tolbert's role figures to shrink further once CeeDee Lamb (ankle) and KaVontae Turpin (foot) return, and it wouldn't be a shock if he got bumped from the regular game-day roster completely at that point.",
      "updated_at": "2025-10-14 18:29:10.860424"
    },
    {
      "player_name": "Javonte Williams",
      "team": "DAL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Cowboys were forced into a relatively pass-heavy game script as they kept pace with the Panthers. That limited Williams to a season-low 13 carries, but the primary issue was his lack of efficiency. Williams' longest rush went for only six yards, and his longest reception was good for only nine yards. The positive takeaway is that Williams earned 18 touches and the next closest Dallas back (Jaydon Blue) had only three. Williams should have a strong chance to bounce back in Week 7 against Washington.",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "Jaydon Blue",
      "team": "DAL",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie running back saw only five snaps (nine percent) on offense as Javonte Williams continues to dominate the workload in the Dallas backfield. Blue did gain 40 yards on two kickoff returns, but even that role will disappear once KaVontae Turpin (foot) gets healthy. Blue's only fantasy value right is as insurance against a Williams injury.",
      "updated_at": "2025-10-14 18:29:10.860424"
    },
    {
      "player_name": "KaVontae Turpin",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Foot",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860424"
    },
    {
      "player_name": "Ryan Flournoy",
      "team": "DAL",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Flournoy maintained a role in the Dallas pass-catching corps with both CeeDee Lamb (ankle) and KaVontae Turpin (foot). He couldn't follow up his breakout Week 5 performance, but Flournoy managed to finish third on the team in both targets and yards. He appears to be the preferred option over Jalen Tolbert in the offense, but Flournoy is likely to be rendered less relevant for fantasy purposes as the Cowboys' wide receivers get healthier.",
      "updated_at": "2025-10-14 18:29:10.860424"
    },
    {
      "player_name": "Adam Trautman",
      "team": "DEN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Trautman was a complete non-factor against the Jets, as the veteran was not involved in the Broncos' offensive attack Sunday. The 28-year-old played 23 of Denver's 60 offensive snaps, behind fellow tight end Evan Engram (28) and tied with teammate Nate Adkins. Due to his usage as a blocker, Trautman offers very little in the way of fantasy production most weeks. The sixth-year tight end should be ignored for fantasy purposes when the Broncos host the Giants in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860426"
    },
    {
      "player_name": "Bo Nix",
      "team": "DEN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Nix played the role of game manager for Denver in a gritty defensive victory overseas in London. The 25-year-old did not complete a pass for the entirety of the third quarter, which helped contribute to his second-lowest yardage output as a passer this season. On the bright side, Nix was involved in the only touchdown scored for either side Sunday, delivering a 16-yard strike to TE Nate Adkins in the first quarter. With nine touchdowns thrown to four interceptions through six starts, Nix checks in as a middling fantasy option in Week 7 when the Broncos host the Giants next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860428"
    },
    {
      "player_name": "Courtland Sutton",
      "team": "DEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Sutton traveled overseas to London for Sunday's international tilt, only to be greeted impolitely by Jets' CB Sauce Gardner once the game kicked off. The shutdown corner won his individual matchup against Sutton, holding Denver's No. 1 wideout to just one reception in the narrow victory. This was Sutton's second one-catch performance through six starts this season, which would be concerning if he hadn't posted WR1 numbers in his four other appearances. Sunday's dud can be written off as a bad matchup coupled with an unfavorable game script. Look for Sutton to get back to his productive ways against the Giants next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860427"
    },
    {
      "player_name": "Evan Engram",
      "team": "DEN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Engram led Denver in targets, receptions and yardage in an odd victory that saw No. 1 WR Courtland Sutton finish with just one reception. The 30-year-old Engram also recorded his first rushing attempt of the season, something we haven't seen consistently from the tight end since his early years as a member of the New York Giants. Sunday's solid showing overseas comes on the heels of the veteran tight end's first touchdown of the year against the Eagles last week. Managers in need of help at the tight-end position should take a serious look at the ascending Engram in Week 7 when the Broncos host the aforementioned Giants next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860427"
    },
    {
      "player_name": "J.K. Dobbins",
      "team": "DEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Denver's entire backfield struggled to find running lanes Sunday, with no tailbacks finishing with a per-carry average higher than 3.0 yards in the win. Dobbins still comfortably led the Broncos with 14 rushing attempts, 12 more than rookie backup RJ Harvey. This was easily Dobbins' worst fantasy score of the season after providing managers with five weeks of consistent RB2 production. The veteran starter has an excellent opportunity to get back on track in Week 7 against the Giants, who currently are surrendering 128.8 rushing yards per game thus far this season.",
      "updated_at": "2025-10-14 18:29:10.860427"
    },
    {
      "player_name": "Jaleel McLaughlin",
      "team": "DEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McLaughlin made his season debut Sunday after being a healthy inactive for Denver's first five games of the 2025 campaign. The third-year running back played just six of the Broncos' 60 offensive snaps, well behind both J.K. Dobbins (30) and RJ Harvey (17). Fellow running back Tyler Badie was inactive for the first time in Week 6, giving McLaughlin the opportunity against the Jets. With that said, it remains to be seen how the Broncos will deploy their running back rotation behind Dobbins and Harvey going forward. Barring injuries, however, McLaughlin remains far off the fantasy radar heading into a Week 7 matchup against the Giants.",
      "updated_at": "2025-10-14 18:29:10.860426"
    },
    {
      "player_name": "Marvin Mims Jr.",
      "team": "DEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Mims played 21 of the Broncos' 60 offensive snaps Sunday, behind fellow wide receivers Courtland Sutton (48), Pat Bryant (35) and Troy Franklin (35). The third-year wideout's 35 percent snap share was his lowest mark of the season. Mims has flashed his play-making ability at times this season, but his inconsistent usage in Denver's offense makes him extremely difficult to trust for fantasy purposes. The 23-year-old will have his next chance to take a step forward in a Week 7 matchup against the Giants, yet he'll continue to face stiff competition for targets in a crowded receiving corps.",
      "updated_at": "2025-10-14 18:29:10.860426"
    },
    {
      "player_name": "Pat Bryant",
      "team": "DEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bryant's two targets Sunday were his first targets since Week 2. The rookie wideout played 35 of the Broncos' 60 offensive snaps in the contest, tied for the second most wide receiver snaps with Troy Franklin while playing behind Courtland Sutton (48). Bryant's 58 percent snap share was his highest mark of the season, so it's possible the Broncos will look to get him more involved as the season progresses. Nonetheless, the 22-year-old Illinois product remains difficult to trust for fantasy purposes heading into a Week 7 matchup against the Giants.",
      "updated_at": "2025-10-14 18:29:10.860425"
    },
    {
      "player_name": "RJ Harvey",
      "team": "DEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Harvey once again operated as the clear No. 2 back behind J.K. Dobbins, who significantly outpaced the rookie by 12 carries. However, Harvey continued to enjoy a solid pass-catching role, extending his streak of games with at least three receptions to four contests. Nevertheless, Harvey's persistently modest role will continue to render him as a deep-league-only option and large-field tournament play in DFS formats unless Dobbins sustains an injury.",
      "updated_at": "2025-10-14 18:29:10.860427"
    },
    {
      "player_name": "Sam Ehlinger",
      "team": "DEN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860426"
    },
    {
      "player_name": "Troy Franklin",
      "team": "DEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Franklin's day in London got off to a rubbish start when he coughed up the first fumble of his career on his first reception of the contest. The silver lining for fantasy managers was that the wideout remained involved offensively following the turnover, receiving three more touches in the narrow win. Franklin has shown flashes of upside early in his sophomore campaign, but Sunday's dud is an example of the inconsistency he can exhibit. The 22-year-old's value is likely limited to deeper formats in next Sunday's tilt against the Giants.",
      "updated_at": "2025-10-14 18:29:10.860427"
    },
    {
      "player_name": "Tyler Badie",
      "team": "DEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860426"
    },
    {
      "player_name": "Amon-Ra St. Brown",
      "team": "DET",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "St. Brown maintained his role as Jared Goff's favorite target, but it was otherwise a tough showing for him. His longest catch of the day went for only 12 yards, and he also uncharacteristically dropped a pass on a key fourth-down attempt midway through the second quarter, which shifted the momentum of the game. This marked the first time since Week 1 that St. Brown has failed to reach 70 receiving yards, and he should bounce back in Week 7 in a matchup of high-powered offenses against Tampa Bay.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "David Montgomery",
      "team": "DET",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Montgomery nearly had a one-yard passing touchdown on the opening possession of the game to Jared Goff, but the score was nullified by an illegal motion penalty on Detroit. With the team falling behind early, the running back never really was able to establish himself on the ground, logging a season-low four totes. Montgomery will look to bounce back Week 7 against the Buccaneers.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "Isaac TeSlaa",
      "team": "DET",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "TeSlaa played a season-high 25 snaps on offense, but he didn't see a target for the second time in three weeks. The wide receiver continues to be a non-factor from a fantasy perspective this season, operating as a depth option behind Amon-Ra St. Brown and Jameson Williams. Through six games, TeSlaa has caught three of five targets for 54 yards and two touchdowns.",
      "updated_at": "2025-10-14 18:29:10.860428"
    },
    {
      "player_name": "Jahmyr Gibbs",
      "team": "DET",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Gibbs regained control of the Detroit backfield by a comfortable margin, out-touching David Montgomery 18-6. However, he had only five touches in the second half as the Lions were forced into a pass-heavy offense. Gibbs was inefficient with his opportunity on the ground, but the bigger concern is his lack of involvement as a pass catcher. He now has two or fewer catches in three consecutive games while recording a total of 39 receiving yards in that span. Despite some shortcomings in his profile, Gibbs' role in a strong offense will keep him as a must-start option, with Sunday's loss marking only the second time in six contests that he's failed to find the end zone.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "Jameson Williams",
      "team": "DET",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Williams finally put together a strong showing, leading the Lions in receiving yards while finding the end zone for the first time since Week 2. His touchdown catch was his longest of the day, as he caught a pass deep across the middle of the field before crashing through several defenders for a 22-yard score. Williams also tallied a pair of 15-yard gains to help him surpass 50 receiving yards in a game for only the second time this season.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "Jared Goff",
      "team": "DET",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Goff had an interesting start to the game, as he had a touchdown catch nullified by a penalty on Detroit's opening possession. He was out-dueled by Patrick Mahomes from there, but he still turned in a decent performance, highlighted by three completions at least 20 yards -- including a 22-yard touchdown connection with Jameson Williams. Goff now has multiple scores in each of his last three games.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "Kalif Raymond",
      "team": "DET",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Raymond was cleared to play after suffering a neck injury in Week 5, but he only logged two snaps on offense and one snap with the special-teams unit. The wide receiver will look to be more involved Week 7 versus the Buccaneers after having an additional week to return to form following his injury.",
      "updated_at": "2025-10-14 18:29:10.860428"
    },
    {
      "player_name": "Sam LaPorta",
      "team": "DET",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "LaPorta was one of the more effective pass catchers in the Detroit offense, delivering two key receptions. The first was a 26-yard catch and run to end the first quarter, which ultimately helped set up a touchdown. LaPorta caught a touchdown of his own early in the fourth quarter on an impressive one-handed, toe-tapping grab in the back of the end zone from four yards away. LaPorta has put together consecutive strong showings, combining to record 10 receptions for 147 yards and two touchdowns in his last two contests.",
      "updated_at": "2025-10-14 18:29:10.860428"
    },
    {
      "player_name": "Sione Vaki",
      "team": "DET",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Groin",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860428"
    },
    {
      "player_name": "Christian Watson",
      "team": "GB",
      "position": "WR",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Knee - ACL",
      "description": "Coming back from an ACL tear suffered in Week 18 last season, Watson returned to practice Monday and then was listed as a limited participant Wednesday and Thursday. It sounds like he could play as soon as Week 7 or 8, but it won't happen this Sunday in a game where the Packers are favored by nearly two touchdowns.",
      "updated_at": "2025-10-14 18:29:10.860431"
    },
    {
      "player_name": "Dontayvion Wicks",
      "team": "GB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "Prior to departing in the third quarter, Wicks notched two catches (on two targets) for 15 yards. The Packers will be rolling with Matthew Golden, Romeo Doubs, Malik Heath and Savion Williams at wide receiver while Wicks is sidelined.",
      "updated_at": "2025-10-14 18:29:10.860430"
    },
    {
      "player_name": "Jordan Love",
      "team": "GB",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Packers were happy to rely upon Josh Jacobs as the primary driver of their offense, but Love turned in a strong performance when called upon. He completed six passes of at least 20 yards and tacked on a touchdown pass of 19 yards. Love continues to operate Green Bay's offense effectively, though he's now taken to the air fewer than 30 times in three of five games this season. That makes him reliant upon big plays and touchdowns to deliver for fantasy purposes.",
      "updated_at": "2025-10-14 18:29:10.860430"
    },
    {
      "player_name": "Josh Jacobs",
      "team": "GB",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Packers had an efficient offensive day, both on the ground and through the air. Jacobs unsurprisingly led the way as a rusher, ripping off long runs of 16 and 14 yards -- the latter of which went for a touchdown to kick off the fourth quarter. He also turned in his third straight game with at least four catches. Despite not reaching 100 rushing yards in any game, Jacobs has found the end zone six times in five contests and remains one of the most reliable fantasy contributors at running back.",
      "updated_at": "2025-10-14 18:29:10.860430"
    },
    {
      "player_name": "Luke Musgrave",
      "team": "GB",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was more of the same for Musgrave, who heads into Green Bay's Week 5 bye with totals of four receptions for 42 yards. Tucker Kraft remains the man at the tight end position for the Packers.",
      "updated_at": "2025-10-14 18:29:10.860431"
    },
    {
      "player_name": "Matthew Golden",
      "team": "GB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Golden continues to get more involved in the Green Bay offense, as he's now earned at least five targets in each of his last three games. He was impressive with the opportunity, ripping off long gains of  35 and 31 yards, the latter of which all but clinched a win for the Packers. Golden topped 100 yards from scrimmage for the first time in his career while showcasing his ability to work deep down the field and also pick up yards after the catch. He appears to be earning trust from coaches and Jordan Love, which should lead to more consistent usage as the season progresses.",
      "updated_at": "2025-10-14 18:29:10.860430"
    },
    {
      "player_name": "Romeo Doubs",
      "team": "GB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Doubs was Jordan Love's top target in Sunday's win, leading the team in targets. He converted that into his third performance of 50 or more receiving yards this season, thanks to long gains of 21 and 15 yards. Doubs isn't likely to turn in huge fantasy performances often thanks to the emergence of Matthew Golden and Tucker Kraft, but it's clear he has rapport and the trust of Love, which should be enough to keep Doubs involved in the offense.",
      "updated_at": "2025-10-14 18:29:10.860429"
    },
    {
      "player_name": "Savion Williams",
      "team": "GB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "A groin injury limited Williams in practice all week, but the rookie third-rounder has been cleared to play in Sunday's home contest. He logged three catches on a many targets for 22 yards while adding one kick return for 24 yards during the Packers' Week 4 tie with the Cowboys.",
      "updated_at": "2025-10-14 18:29:10.860431"
    },
    {
      "player_name": "Tucker Kraft",
      "team": "GB",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kraft had a quiet day, with Romeo Doubs and Matthew Golden dominating looks among the Green Bay pass catchers. He salvaged the low-volume performance with a pair of big plays, the most important of which was a 19-yard touchdown midway through the fourth quarter. Kraft now has three touchdowns on the season while also recording at least three catches in three of his five games.",
      "updated_at": "2025-10-14 18:29:10.860430"
    },
    {
      "player_name": "Braxton Berrios",
      "team": "HOU",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860431"
    },
    {
      "player_name": "Brenden Bates",
      "team": "HOU",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bates served as the third tight end for the second consecutive week, playing 13 snaps behind Dalton Schultz and Harrison Bryant. Bates' two catches came on the final drive of the game.",
      "updated_at": "2025-10-14 18:29:10.860432"
    },
    {
      "player_name": "British Brooks",
      "team": "HOU",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Brooks was one of five running backs for the game and played 11 snaps. Houston won its second consecutive game while running the ball more than passing it, which may explain why so many backs were active. Brooks had been a healthy scratch Weeks 1 and 3 before suiting up the last two games.",
      "updated_at": "2025-10-14 18:29:10.860433"
    },
    {
      "player_name": "Christian Kirk",
      "team": "HOU",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kirk had his best day as a Texan due primarily to a 47-yard catch to start the fourth quarter, narrowly missing a touchdown while being taken down at the three-yard line. Houston has spread its targets relatively evenly between several different pass catchers early this season, leaving Kirk with only four targets in consecutive games. That limited volume will hurt his fantasy outlook, though Sunday's big play was encouraging.",
      "updated_at": "2025-10-14 18:29:10.860433"
    },
    {
      "player_name": "Dalton Schultz",
      "team": "HOU",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Schultz was C.J. Stroud's favorite target in the first half, recording four receptions on four targets for 53 yards. Schultz played a key role on multiple scoring drives for Houston, recording 11- and 12-yard receptions to keep a pair of possessions alive on third down before logging a 21-yard catch to set up a touchdown just before halftime. This was Schultz's highest yardage total of the season, and he has five receptions in three consecutive contests.",
      "updated_at": "2025-10-14 18:29:10.860433"
    },
    {
      "player_name": "Dameon Pierce",
      "team": "HOU",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Active for the first time since Week 1, Pierce played a season-high 16 snaps, and all his carries came in the fourth quarter after Houston built a 41-10 lead. Nick Chubb and Woody Marks are clearly at the top of the depth chart, and it's unclear why head coach DeMeco Ryans would make Pierce active following three consecutive healthy scratches.",
      "updated_at": "2025-10-14 18:29:10.860433"
    },
    {
      "player_name": "Graham Mertz",
      "team": "HOU",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860432"
    },
    {
      "player_name": "Jayden Higgins",
      "team": "HOU",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Higgins was on the field for a season-high 39 snaps (56 percent share), as the rookie's role has steadily increased. Sunday's four targets also were a season high.",
      "updated_at": "2025-10-14 18:29:10.860432"
    },
    {
      "player_name": "Jaylin Noel",
      "team": "HOU",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Noel was on the receiving end of a four-yard touchdown pass from C.J. Stroud early in the fourth quarter that upped Houston's advantage to 41-10. It was the first NFL touchdown for the rookie wideout, who then engendered some ill on the road by mimicking the dance of legendary Baltimore linebacker Ray Lewis. Noel, who has five catches (on seven targets) for 22 yards through five games, has mostly contributed on special teams as a returner.",
      "updated_at": "2025-10-14 18:29:10.860432"
    },
    {
      "player_name": "Joe Mixon",
      "team": "HOU",
      "position": "RB",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Foot",
      "description": "Caserio's comments during his press conference mark the first time that a member of the Houston brass has addressed Mixon's status since the start of the regular season. The veteran running back was placed on the non-football injury list ahead of training camp after getting hurt during an individual workout in the spring, and the Texans have been non-committal on a timeline for his return ever since. Given that the Texans aren't yet hinting that Mixon will even resume practicing in the near future, the 29-year-old doesn't look like he's on track to be an option in the Houston backfield until late in the season, if at all. The Texans are likely to continue to lean on a timeshare of Nick Chubb and rookie Woody Marks at running back for the foreseeable future.",
      "updated_at": "2025-10-14 18:29:10.860431"
    },
    {
      "player_name": "Woody Marks",
      "team": "HOU",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Marks rotated within drives with Nick Chubb for most of the game, but he still ended up with four fewer carries. Neither back was able to get much going, and three of Marks' seven carries went for one yard or less. While it was a disappointing follow-up to what appeared to be a breakout performance in Week 5, game script didn't help as Houston pulled most of its offensive starters early in the fourth quarter.",
      "updated_at": "2025-10-14 18:29:10.860433"
    },
    {
      "player_name": "Xavier Hutchinson",
      "team": "HOU",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hutchinson had gone 36 games into his NFL career without reaching pay dirt prior to Sunday's two-TD outburst. Noted for his hard work and willingness to do the dirty job of blocking, Hutchinson was rewarded with three red-zone looks in the win. He now has 12 receptions, tying his career high set last year, for 110 yards through five games. His place in the Texans offense was uncertain after the team drafted two wide receivers in the 2025 NFL Draft, but he's maintained a high volume of playing time, as his 205 snaps (64.9 percent share) are second only to Nico Collins (252, 79.7 percent).",
      "updated_at": "2025-10-14 18:29:10.860432"
    },
    {
      "player_name": "Adonai Mitchell",
      "team": "IND",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With Alec Pierce back from a concussion, Mitchell is the odd man out in the Colts' Week 6 wideout corps. Also in uniform at the position Sunday are Michael Pittman, Josh Downs, Ashton Dulin and Anthony Gould.",
      "updated_at": "2025-10-14 18:29:10.860436"
    },
    {
      "player_name": "Alec Pierce",
      "team": "IND",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pierce needed just the pair of grabs to finish second on the day in receiving yardage for the Colts. Pierce was making his return from a two-game absence due to a concussion, and the fourth-year pro finished with his third-highest receiving yardage total of the season. Pierce should fill his usual downfield role in a Week 7 road matchup against the Chargers.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Ameer Abdullah",
      "team": "IND",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Adullah was elevated for the second straight week for this past Sunday's win over Arizona and logged three snaps on offense, rushing once for seven yards and catching his lone target for nine yards. He also played 10 snaps on special teams. Though Abdullah is back on the Colts' practice squad for now, he could be elevated again in Week 7 versus the Chargers if Tyler Goodson (groin) remains sidelined.",
      "updated_at": "2025-10-14 18:29:10.860434"
    },
    {
      "player_name": "Ashton Dulin",
      "team": "IND",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Dulin had five targets and two receptions for 55 yards the previous week against Las Vegas, but moved back to a bench role with Alec Pierce returning from a concussion. Dulin is a key player on special teams but could still be used as a fourth receiver, as he may have moved ahead of Adonai Mitchell on the depth chart. Mitchell was a healthy inactive for Sunday's game.",
      "updated_at": "2025-10-14 18:29:10.860434"
    },
    {
      "player_name": "DJ Giddens",
      "team": "IND",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was surprisingly Ameer Abdullah who had both a carry and a reception in the game, although the veteran RB played only three snaps on offense. Giddens is still likely the running back who would get the most work if Jonathan Taylor were to get hurt, though Tyler Goodson has been sidelined with a groin injury and could factor in once he's healthy. Either way, Taylor is getting almost every touch in the backfield in non-blowouts, and that doesn't look likely to change.",
      "updated_at": "2025-10-14 18:29:10.860434"
    },
    {
      "player_name": "Daniel Jones",
      "team": "IND",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jones put together another efficient performance that's become par for the course for him in the Colts' scheme. Jones eclipsed the 70.0 percent completion threshold for the fourth time overall in the first six games, and the veteran signal-caller also tossed a pair of touchdown for the second consecutive contest by connecting with Tyler Warren and Josh Downs from eight and five yards out, respectively. Jones added a three-yard scoring rush just before the halfway point of the second quarter, his fourth touchdown on the ground already. Jones will remain a highly coveted option in all formats for a Week 7 road showdown against the Chargers that could develop into a high-scoring affair.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Jonathan Taylor",
      "team": "IND",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Taylor put together another signature stat line, averaging 5.9 yards per carry on his way to his second-highest rushing yardage total of the season. He also scored his fourth touchdown of the last two games on a one-yard rush with under five minutes remaining to erase a 27-24 deficit and put the final points of the day up on the board. Taylor is already sitting on 603 rushing yards, seven rush TDs and an average of 5.3 yards per carry through six contests, and he'll face the Chargers' porous run defense in a Week 7 road showdown next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Josh Downs",
      "team": "IND",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Downs' day got off on the right foot with receptions of nine, 11 and five yards on the opening drive, and he ultimately added his first touchdown catch of the season on a five-yard grab early in the fourth quarter. Downs has back-to-back six-catch efforts heading into a Week 7 road matchup against the Chargers, and he's logged at least five targets in three consecutive contests.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Michael Pittman Jr.",
      "team": "IND",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pittman's output was below his usual standards, as all three components of his receiving line were season-low figures. The veteran wideout's lackluster afternoon coincided with the return of Alec Pierce from a two-game absence due to a concussion, although the two receivers have very different skill sets and roles within the offense. Given his numbers were essentially outliers, Pittman should have a good chance to bounce back to some degree during a Week 7 road showdown against the Chargers next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Tyler Goodson",
      "team": "IND",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Groin",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860434"
    },
    {
      "player_name": "Tyler Warren",
      "team": "IND",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Warren tied Josh Downs for the team lead in receptions and led the way in both receiving yards and targets on an afternoon where he also recorded his second touchdown grab of the season. Warren found the end zone from eight yards out to cap off the opening possession of the game, and he tallied his fifth catch of 20-plus yards this season earlier in the drive with a 23-yard reception. The rookie tight end will continue to serve as a focal point of the offense during a Week 7 marquee road matchup against the Chargers.",
      "updated_at": "2025-10-14 18:29:10.860435"
    },
    {
      "player_name": "Will Mallory",
      "team": "IND",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860434"
    },
    {
      "player_name": "Bhayshul Tuten",
      "team": "JAX",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie fourth-round pick continues to operate as Jacksonville's No. 2 tailback but saw his smallest workload since the season opener Sunday. Tuten showcased his potential upside in Week 2 with 10 touches for 74 yards, but in the ensuing four contests he's totaled just 16 carries for 55 yards and four receptions for 27 yards. He's likely to remain in a limited role as long as Travis Etienne remains healthy.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Brian Thomas Jr.",
      "team": "JAX",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thomas led the Jaguars' pass catchers across the board in receptions, receiving yards and targets, one-upping the then season-best 80-yard effort he'd posted against the Chiefs on Monday night. The second-year wideout also scored his long-awaited first touchdown of the campaign via a 21-yard grab late in the first quarter that opened the scoring on the afternoon. Thomas has started to find some equilibrium in his production over the last three games, and he'll aim to extend the momentum in a Week 7 matchup against the Rams in London.",
      "updated_at": "2025-10-14 18:29:10.860438"
    },
    {
      "player_name": "Cody Schrader",
      "team": "JAX",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860436"
    },
    {
      "player_name": "Dyami Brown",
      "team": "JAX",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The 26-year-old tied for third on the team in targets but finished below 20 receiving yards for his third consecutive contest. Brown totaled eight receptions for 109 yards and a touchdown in the first two weeks of the season, but he has just six catches for 35 yards across his past three games.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Parker Washington",
      "team": "JAX",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The 2023 sixth-round pick finished second on the team in receiving yards, but that's not saying much given that Brian Thomas was the only Jacksonville pass catcher to eclipse 30 yards. Washington was fairly involved in the passing game across Weeks 2 and 3 with nine catches for 110 yards, but over the past three games he has just four receptions for 45 yards and a touchdown.",
      "updated_at": "2025-10-14 18:29:10.860436"
    },
    {
      "player_name": "Quintin Morris",
      "team": "JAX",
      "position": "TE",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Groin",
      "description": "Morris will not travel with the team to London this week. With Morris joining Brenton Strange (IR,quadriceps) on the shelf, the Jaguars figure to roll with Hunter Long, Johnny Mundt and possibly practice-squad addition Jordan Akins at tight end versus Los Angeles.",
      "updated_at": "2025-10-14 18:29:10.860436"
    },
    {
      "player_name": "Tim Patrick",
      "team": "JAX",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The veteran wideout was once again minimally involved in Jacksonville's passing game, but he took advantage of his lone target for his first touchdown of the campaign. Patrick has received exactly one target in five straight contests and doesn't have much fantasy utility in his current role as a depth receiver.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Travis Etienne Jr.",
      "team": "JAX",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Etienne was absolutely stonewalled on the ground by a talented Seahawks front seven, although he was able to partly atone for the shortfall with a solid day through the air that saw him post new season highs in receptions, receiving yards and targets. The fifth-year back now has back-to-back 12-carry tallies after opening the season with at least 14 rush attempts in each of the first four games, but he remains the Jaguars' unquestioned No. 1 back and next faces a Rams defense that was gashed by the Ravens' Derrick Henry in Week 6.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Travis Hunter",
      "team": "JAX",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "After consecutive encouraging performances during which Hunter generated a combined 6-106-0 receiving line on eight targets, the rookie second overall pick was back to a very modest, low-upside role Sunday. All but one yard of Hunter's tally came on one catch, underscoring how he didn't have any sort of downfield profile. Although he developed a well-earned college reputation for being an explosive player who can offer plenty at deeper depths of target than what he's been seeing, Hunter is surprisingly stuck in a limited role despite head coach Liam Coen's typically creative offensive designs.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Trevor Lawrence",
      "team": "JAX",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Lawrence's final passing line with more than adequate, but he also took seven sacks and finished with an ugly 46.6 QBR for the afternoon. The 2021 first overall pick did continue to cultivate his connection with No. 1 receiver Brian Thomas, who he hit on eight occasions for 90 yards, including a 21-yard touchdown late in the first quarter. Lawrence hit Tim Patrick from 26 yards out early in the fourth quarter for his other TD toss, the quarterback's first multi-touchdown-pass tally since Week 2. Despite the solid numbers, the modest point total did Jacksonville in Sunday, a matter he'll look to rectify in a London matchup against the high-powered Rams in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860437"
    },
    {
      "player_name": "Brashard Smith",
      "team": "KC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith claimed just six total offensive snaps in this contest and has totaled double-digit offensive snaps just once all season. He remains a reliable weapon as a receiver out of the backfield, handling three catches in each of the last three tilts, but he failed to register a carry Sunday for the first time since the season opener versus the Chargers. Smith converted from wide receiver to running back late in his career at SMU, so it shouldn't be shocking that he excels in the receiving department. The rookie remains primarily a speculative hold in dynasty formats at this juncture.",
      "updated_at": "2025-10-14 18:29:10.860438"
    },
    {
      "player_name": "Elijah Mitchell",
      "team": "KC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860439"
    },
    {
      "player_name": "Hollywood Brown",
      "team": "KC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Brown delivered a standout performance under the bright lights of Sunday Night Football when he lifted his team with two trips to the end zone in the second half. The 28-year-old has done an admirable job starting for a thin Chiefs' receiving corps, producing a 30-302-3 line through six weeks of action. The impending doom Brown's managers are currently feeling is the looming return of Kansas City's top WR Rashee Rice. The suspended wideout will return for next Sunday's tilt against the Raiders, potentially eating into his replacement's production in the process. Brown should remain rostered until the dust settles from Rice's return, but expectations should be kept in check for Week 7.",
      "updated_at": "2025-10-14 18:29:10.860440"
    },
    {
      "player_name": "Isiah Pacheco",
      "team": "KC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pacheco finished Sunday's win as the Chiefs' leading rusher, garnering six more touches than veteran backup Kareem Hunt (6-23-0). The 26-year-old Pacheco had been mired in an even timeshare for most of the season, so Sunday's disparity in touches could be something to monitor moving forward. Pacheco would need that hypothetical increase in usage in order to develop into a reliable starting option in fantasy. Until then, treat the physical runner as nothing more than a flex option against the Raiders next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860439"
    },
    {
      "player_name": "Jared Wiley",
      "team": "KC",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860439"
    },
    {
      "player_name": "JuJu Smith-Schuster",
      "team": "KC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith-Schuster made the most of his three grabs, tallying 30, 17 and 10 yards on each of them to reach 57 for the day, but that doesn't generate enough fantasy value to warrant using him in the majority of formats. On top of that, Rashee Rice returns this week to reclaim his spot in the slot. With Hollywood Brown claiming a starting role and Tyquan Thornton and second-year wideout Xavier Worthy all vying for playing time, Smith-Schuster is at risk of getting squeezed out of some snaps moving forward.",
      "updated_at": "2025-10-14 18:29:10.860438"
    },
    {
      "player_name": "Kareem Hunt",
      "team": "KC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hunt has seen his playing time drop off in the past couple of weeks, recording sub-40 percent snap shares after crossing that threshold, including double-digit carries, against both the Giants in Week 3 and Ravens in Week 4. He remains a handcuff option in leagues with a little bit of fantasy upside if he reaches paydirt. Still, he won't find consistent value as long as Isiah Pacheco is healthy and available.",
      "updated_at": "2025-10-14 18:29:10.860438"
    },
    {
      "player_name": "Noah Gray",
      "team": "KC",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Gray hasn't posted any fantasy-worthy stat lines this season, notching no more than three catches in a contest. He's recorded just eight catches for 47 yards overall this season and has yet to reach pay dirt after doing so five times last season. Gray isn't of particular fantasy interest as long as Travis Kelce remains available, but he could spark some interest should Kelce miss any time.",
      "updated_at": "2025-10-14 18:29:10.860438"
    },
    {
      "player_name": "Patrick Mahomes",
      "team": "KC",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was a masterful performance from Mahomes on the national stage as he methodically dismantled Detroit's defense to the tune of a 132.2 passer rating. The 29-year-old posted his second four-touchdown game over his last three starts, quickly putting his slow start to the campaign in the rearview mirror. His fourth rushing score this season also tied the regular-season high he set back in 2022. A red-hot Mahomes will set his sights on a division foe when the Chiefs host the Raiders next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860440"
    },
    {
      "player_name": "Rashee Rice",
      "team": "KC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "While the Chiefs have been granted a roster exemption for Rice that expires Oct. 20 and thus will need to officially activate him by Saturday in order for him to play Week 7, at this time there's no reason to believe that won't occur. The looming return of Rice should provide a major boost to the offense of the 3-3 Chiefs, and assuming no issues at practice this week, the 2023 second-rounder should immediately step into a prominent role in a WR corps that also includes Xavier Worthy, Hollywood Brown, JuJu Smith-Schuster and Tyquan Thornton.",
      "updated_at": "2025-10-14 18:29:10.860439"
    },
    {
      "player_name": "Travis Kelce",
      "team": "KC",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kelce kept the good times rolling with another positive fantasy result following last week's 7-61-1 receiving line. The 35-year-old hasn't posted eye-popping numbers in any particular week, but the consistent production at a shallow position certainly makes fantasy managers' lives easier when constructing weekly lineups. Kelce will continue operating as one of Patrick Mahomes' top and most-trusted targets against the Raiders next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860440"
    },
    {
      "player_name": "Tyquan Thornton",
      "team": "KC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thornton fell back to earth Week 6, playing just 27 percent of offensive snaps and finishing without a target for the first time this season. His decline in usage and involvement bodes especially poorly with Rashee Rice (suspension) eligible for reinstatement Week 7 versus the Raiders. As such, Thornton looks positioned to work behind all of Rice, Xavier Worthy, Hollywood Brown and Juju Smith-Schuster versus Las Vegas in Week 7, a role wherein he could be relegated to little more than scripted downfield plays.",
      "updated_at": "2025-10-14 18:29:10.860439"
    },
    {
      "player_name": "Xavier Worthy",
      "team": "KC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Worthy endured another limited practice week in order to suit up for the Chiefs on Sunday. The speedy wideout has missed two-plus games of action due to injury, but he has now started three consecutive games as his health gradually returns to full strength. Worthy made his first trip to the end zone this season in the primetime win, salvaging what would have been an otherwise disappointing night at the office. The 2024 first-round selection averaged 86.0 combined yards from scrimmage over his first two games back from injury, so Sunday's low usage shouldn't be of concern. The biggest threat to Worthy's target share in Week 7 is the scheduled return of suspended WR Rashee Rice, who is likely to reclaim his role as Kansas City's top wideout against Las Vegas next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860440"
    },
    {
      "player_name": "Derius Davis",
      "team": "LAC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860443"
    },
    {
      "player_name": "Hassan Haskins",
      "team": "LAC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Haskins was supposed to be part of a committee with Kimani Vidal replacing the injured Omarion Hampton (IR, ankle), but Vidal quickly proved to be the far more explosive back and ran away with the workload in the second half, finishing with 124 rushing yards and 14 receiving yards plus a touchdown. That's about as definitive of a difference as one could envision and likely means Haskins, who has primarily been a special-teams player during his time with the Chargers, could get squeezed out of platoon work after Vidal's amazing efforts. It's worth noting Miami's run defense is one of the worst in the league, and the Chargers could lean on the bruising Michigan product in short-yardage situations in future weeks.",
      "updated_at": "2025-10-14 18:29:10.860444"
    },
    {
      "player_name": "Justin Herbert",
      "team": "LAC",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Despite being under duress for most of the game, Herbert was excellent moving around the pocket and extending time to create enough room to hit Ladd McConkey (7-100-1) on a number of crossing routes, while Oronde Gadsden had his biggest game of his young career as an underneath safety net. The emergence of Kimani Vidal as a legitimate piece of the rushing attack, albeit against a porous run defense, could do wonders to help Herbert steady the ship with multiple offensive lineman banged up with varying injuries.",
      "updated_at": "2025-10-14 18:29:10.860444"
    },
    {
      "player_name": "Kimani Vidal",
      "team": "LAC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Despite reports earlier this week Vidal and Hassan Haskins would be a part of a committee, the second-year back proved definitively he was the more explosive player by tallying 138 total yards on 21 touches to Haskins' 23 yards on seven opportunities. Omarion Hampton (ankle) is expected to be out at least a month, and while the Chargers have reportedly been sniffing around available options according to NFL.com's Ian Rapoport, Vidal's massive outing might quiet the trade calls for another week. It's worth noting Miami's run defense is one of the worst in the league, and it should be tougher sledding at home against the Colts next week.",
      "updated_at": "2025-10-14 18:29:10.860444"
    },
    {
      "player_name": "Ladd McConkey",
      "team": "LAC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McConkey's 42-yard reception on the final possession with under a minute to go was the catalyst for the game-winning field goal just three plays later, but the second-year wideout benefitted significantly in the absence of Quentin Johnston (hamstring) by leading the team in receiving yards, targets and receptions for the first time this season. This kind of workload could be the status quo for the foreseeable future as Los Angeles struggles to deal with a litany of injuries, whether to rookie running back Omarion Hampton (ankle), Johnston or a bevy of injured offensive lineman.",
      "updated_at": "2025-10-14 18:29:10.860444"
    },
    {
      "player_name": "Nyheim Miller-Hines",
      "team": "LAC",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hines was elevated to the active roster ahead of Sunday's 29-27 win over the Dolphins, playing just one offensive snap in the contest. Additionally, the running back compiled 97 yards on three kick returns, playing five snaps with the special-teams unit. With Omarion Hampton (ankle) on injured reserve, Hines will likely be elevated again prior to the team's Week 7 matchup with the Colts.",
      "updated_at": "2025-10-14 18:29:10.860443"
    },
    {
      "player_name": "Oronde Gadsden II",
      "team": "LAC",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Gadsden finally had his breakout game after seeing his snap count surge each of the last three weeks. The rookie was repeatedly a checkdown target for Justin Herbert with the offensive line in shambles, but Gadsden responded well and looked good after the catch as well. It's also worth noting Gadsden did this despite Will Dissly (knee) being active for the first time in three weeks, a sure sign the rookie has seemingly taken over as the team's starting tight end.",
      "updated_at": "2025-10-14 18:29:10.860444"
    },
    {
      "player_name": "Quentin Johnston",
      "team": "LAC",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860443"
    },
    {
      "player_name": "Will Dissly",
      "team": "LAC",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Dissly is thus set to return for Sunday's game at Miami after missing each of the past three contests. Rookie tight end Oronde Gadsden took advantage initially, but he saw just one target in the Week 5 loss to Washington despite handling a season-high 61 percent route share. That number likely will drop with Dissly back in the lineup, although it's also possible Dissly mostly takes the snaps that went to Tyler Conklin and Tucker Fisk in recent weeks. Either way, it'll be some form of rotation, with long odds for any one TE to draw more than a handful of targets.",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Blake Corum",
      "team": "LAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "Corum briefly exited Sunday's win in the second quarter due to an ankle injury and was initially labeled as questionable, but he managed to return to action after halftime and finish the day with five carries for 23 yards. Only one of those carries came after his return, however. The second-year pro doesn't have clean bill of health yet, but the fact that he was able to return versus the Ravens lends credence to the notion that he'll be able to play in Week 7 against the Jaguars and handle his usual No. 2 role behind Kyren Williams. Rookie fourth-rounder Jarquez Hunter would benefit from increased opportunities if Corum were to miss any time.",
      "updated_at": "2025-10-14 18:29:10.860446"
    },
    {
      "player_name": "Colby Parkinson",
      "team": "LAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Concussion",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Davante Adams",
      "team": "LAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Adams served as the Rams' top pass-catcher for most of the game with Puka Nacua (ankle) briefly sidelined and then playing at less than full strength for most of the game. Adams led the team with nine targets, but he converted that into his lowest yardage total of the season. Touchdowns have masked his underwhelming stat lines through the first seven games of the season, as Adams has now been held under 60 receiving yards in four of six contests.",
      "updated_at": "2025-10-14 18:29:10.860446"
    },
    {
      "player_name": "Davis Allen",
      "team": "LAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tyler Higbee regained his role as the Rams' top tight end after missing Week 5 with a hip injury, and produced a solid 4-40-1 line on his four targets. Allen only took the field for 21 snaps on offense, slightly more than Terrance Ferguson, who wasn't targeted in the contest. Higbee will likely remain the top option for the Rams at tight end, leaving Allen, Ferguson, and Colby Parkinson (concussion) fighting for playing time in London against the Jaguars in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Jordan Whittington",
      "team": "LAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "In the wake of Puka Nacua (ankle) missing a considerable portion of the contest due to an ankle sprain, it was the second-year pro Whittington who saw the biggest uptick in play time, leading all Rams' wide receivers with 49 snaps on offense. The expanded stint on the field only led to a small uptick in Whittington's stat line, although he did set season-highs in catches and targets. If Nacua were to miss any time with his injury, it appears as though Whittington is most likely to step in alongside Davante Adams and assume a larger role, especially if Tutu Atwell (hamstring) isn't 100 percent next week against the Jaguars.",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Kyren Williams",
      "team": "LAR",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Rams possessed the ball for only 22:05 of game time while averaging only 4.7 yards per play. That led to modest stat lines for the entire skills corps, though Williams was on the better end of things thanks to a three-yard touchdown run early in the third quarter. One play earlier, he made a falling 30-yard reception on fourth down that kept the drive alive. Overall, Williams delivered a well-rounded stat line and also kept the ball secure after losing a fumble in each of his last two games.",
      "updated_at": "2025-10-14 18:29:10.860447"
    },
    {
      "player_name": "Matthew Stafford",
      "team": "LAR",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Stafford had a fairly efficient performance, but it was a tough day for the Rams' offense as a whole. They possessed the ball for only 22:05 while also running their offense with a hobbled Puka Nacua (ankle) for nearly three-quarters of the contest. As a result, Stafford failed to throw for multiple touchdowns for the first time since Week 1 and also turned in his lowest yardage total of the season. His outlook for Week 7 against the Jaguars will depend relatively heavily on Nacua's availability.",
      "updated_at": "2025-10-14 18:29:10.860447"
    },
    {
      "player_name": "Puka Nacua",
      "team": "LAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "The star wideout suffered a left ankle sprain during Sunday's 17-3 win at Baltimore, but Nacua being described in such a manner by McVay is a touch more optimistic than a report from Ian Rapoport of NFL Network that suggested he's set to miss time. Nacua's status appears uncertain at best for Los Angeles' matchup against the Jaguars in London in Week 7, and a Week 8 bye could nudge the team in the direction of caution. McVay hasn't ruled Nacua out yet for this coming Sunday's game, Dragon confirms, so final clarity on his status likely won't arrive until the Rams have had a chance to evaluate him at practice. Stu Jackson of the team's official site reports that scans have indicated Nacua isn't dealing with a long-term injury.",
      "updated_at": "2025-10-14 18:29:10.860446"
    },
    {
      "player_name": "Stetson Bennett IV",
      "team": "LAR",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860446"
    },
    {
      "player_name": "Terrance Ferguson",
      "team": "LAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "While Ferguson was unable to secure any targets on offense, he did take the field for just over 30 percent of the Rams' snaps on offense, a season high. Colby Parkinson (concussion) may return for Week 7 against the Jaguars in London, and with Tyler Higbee establishing himself as the top tight end in the pecking order once again, Ferguson, Parkinson and Davis Allen will share the backup tight end duties as they've been doing for the majority of the season thus far.",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Tutu Atwell",
      "team": "LAR",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860445"
    },
    {
      "player_name": "Tyler Higbee",
      "team": "LAR",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Rams had a disjointed offensive showing, as they were out-possessed by a wide margin by the Ravens and were also dealing with a hobbled Puka Nacua (ankle). Higbee stepped up to lead the team in receiving yards while tallying the game-clinching score early in the third quarter on an eight-yard reception. That was Higbee's first touchdown of the season, and Sunday marked only the third time he's recorded multiple catches in a game.",
      "updated_at": "2025-10-14 18:29:10.860446"
    },
    {
      "player_name": "Albert Okwuegbunam Jr.",
      "team": "LV",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Okwuegbunam was elevated to the Raiders' active roster for a second straight game in Week 5 against the Colts. He didn't end up playing in Week 4 against the Bears, but he saw the field for 31 offensive snaps Sunday due to the absences of Brock Bowers (knee) and Michael Mayer (concussion), which was second among Las Vegas tight ends behind Ian Thomas (38). Okwuegbunam took advantage of the additional playing time, finishing Sunday's loss with five catches (on six targets) for 36 yards, and his five receptions were tied with Ashton Jeanty for most on the Raiders. Okwuegbunam would be in line to be elevated to Las Vegas' active roster for Week 6 against the Titans if one or both of Bowers and Mayer were not cleared to play.",
      "updated_at": "2025-10-14 18:29:10.860443"
    },
    {
      "player_name": "Alex Bachman",
      "team": "LV",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Raiders had elevated Bachman from the practice squad in each of the first three games of the regular season, but the 29-year-old wideout can continue to play in silver and black after being added to the active roster. Bachman has served on both special teams and offense this season and will provide depth at wide receiver.",
      "updated_at": "2025-10-14 18:29:10.860443"
    },
    {
      "player_name": "Ashton Jeanty",
      "team": "LV",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jeanty ground out a solid fantasy day by scoring his third rushing touchdown of the year on a season-high 23 carries. Veteran backup Raheem Mostert (five carries) was the only other rusher to record a touch in the win, highlighting Jeanty's stranglehold on the every-down role out of Las Vegas' backfield. The sixth overall pick from this year's draft has generated 497 combined yards from scrimmage with five total touchdowns through six starts in 2025. Jeanty's offensive involvement has increased with an average of 22.3 touches over the Raiders' last three contests. Fantasy managers can start the Boise State product with confidence for next Sunday's road tilt against the Chiefs.",
      "updated_at": "2025-10-14 18:29:10.860442"
    },
    {
      "player_name": "Brock Bowers",
      "team": "LV",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee - PCL",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Dont'e Thornton Jr.",
      "team": "LV",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thornton played just two offensive snaps in the Raiders' comfortable win, while fellow rookie Jack Bech remained in the WR3 role behind Jakobi Meyers and Tre Tucker. Thornton has gone three consecutive games without a reception, becoming an even tougher stash on deep fantasy benches with Las Vegas' bye approaching after a Week 7 contest in Kansas City.",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Dylan Laube",
      "team": "LV",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "Laube left the field during the second half, and the severity of his injury is currently unclear. With Zamir White (coach's decision) inactive, Ashton Jeanty and Raheem Mostert would be the only healthy running backs on the team if Laube is unable to return.",
      "updated_at": "2025-10-14 18:29:10.860442"
    },
    {
      "player_name": "Geno Smith",
      "team": "LV",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith got the Raiders back in the win column after a recent poor string of play had critics calling for a quarterback change in Las Vegas. The veteran signal-caller appears to have staved off a potential QB controversy with improved play against a struggling Titans squad Sunday. The 34-year-old still couldn't pitch a clean outing, throwing his 10th interception of campaign early in the fourth quarter. The late turnover didn't cost his team a chance at victory, meaning Smith should remain under center for a tough road matchup against the Chiefs next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860442"
    },
    {
      "player_name": "Ian Thomas",
      "team": "LV",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thomas logged just 18 offensive snaps with fellow tight end Michael Mayer returning from a concussion to post a 5-50-1 receiving line on seven targets. Meanwhile, Brock Bowers (knee) is unlikely to return until after the Raiders' Week 8 bye, so Thomas should fill a similar TE2 role behind Mayer at Kansas City in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860440"
    },
    {
      "player_name": "Jack Bech",
      "team": "LV",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bech logged a season-high 46 offensive snaps while playing ahead of fellow rookie Dont'e Thornton in the Raiders' WR3 role, but the increased playing time didn't translate to fantasy production for Bech. Meanwhile, a positive game script allowed for Ashton Jeanty and Raheem Mostert to combine for 28 total carries, though a more difficult matchup at Kansas City in Week 7 awaits.",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Jakobi Meyers",
      "team": "LV",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Meyers' recent struggles continued, as he failed to eclipse 40 receiving yards for the third week running. At least the Raiders were able to pick up a win after losing their previous two contests during the wideout's current slump. Las Vegas is still without the services of star TE Brock Bowers (knee), so Meyers needs to step up his play for both his team and frustrated fantasy managers. Perhaps Meyers can turn his disappointing campaign around if he can find the end zone for the first time in 2025 against the Chiefs next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860442"
    },
    {
      "player_name": "Michael Mayer",
      "team": "LV",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Mayer returned from a two-game layoff to find himself as the Raiders' starting tight end sans Brock Bowers (knee). The veteran backup took full advantage of the opportunity, scoring his first touchdown of the season and rewarding savvy managers who scooped him up for Week 6. It is currently unclear if Bowers will be available for next Sunday's tilt against the Chiefs. If the starter's knee keeps him on the sidelines, then Mayer would retain his elevated streaming appeal in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Raheem Mostert",
      "team": "LV",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Mostert played 13 offensive snaps behind rookie Ashton Jeanty, who handled a bulk of the workload out of the Raiders' backfield with 25 touches for 86 total yards and a score. Expect a similarly one-sided split during a tough Week 7 matchup in Kansas City.",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Tre Tucker",
      "team": "LV",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tucker finished as the Raiders' leading receiver on a low-volume day from the passing offense. The 24-year-old finished with a receiving line somewhere in between the highs and lows we had seen over his previous five appearances. The overall package has been a net positive from the speedy wideout after producing a 24-356-4 line through six starts. Tucker provides enough upside to warrant a spot in most fantasy lineups ahead of next Sunday's tilt against Kansas City.",
      "updated_at": "2025-10-14 18:29:10.860442"
    },
    {
      "player_name": "Zamir White",
      "team": "LV",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860441"
    },
    {
      "player_name": "Cedrick Wilson Jr.",
      "team": "MIA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860447"
    },
    {
      "player_name": "Darren Waller",
      "team": "MIA",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Waller was having a surprisingly forgettable day until the final minute of the contest, when he recorded a seven-yard touchdown grab in the right corner of the end zone with 46 seconds remaining to cap off a 13-play drive and erase a 26-20 deficit. The veteran tight end, who'd come into the day with an 8-105-3 receiving line over his first two games, would have therefore been the hero had Justin Herbert not driven the Chargers down for a game-winning field goal. Waller has now turned a whopping 40.0 percent of his 10 catches to date into touchdowns, and while regression is inevitable, he could be busy in a Week 7 road matchup against a Browns defense that could force the struggling Tua Tagovailoa to get the ball out quickly.",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "De'Von Achane",
      "team": "MIA",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Achane had been uncharacteristically bottled up by the Panthers in Week 5, but the electric back set an early tone Sunday with a 49-yard breakaway touchdown run with just over four minutes remaining in the first quarter. He'd go on to add a four-yard scoring scamper with just under eight minutes left in the contest, a score that narrowed a 26-13 deficit. Achane eclipsed the century mark for the first time this season with Sunday's production, and his carry total was his second highest through the first six contests. The third-year back should play a key role again during a Week 7 road clash against the tough Browns defense.",
      "updated_at": "2025-10-14 18:29:10.860449"
    },
    {
      "player_name": "Jaylen Waddle",
      "team": "MIA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Waddle fell just short of his second consecutive 100-yard effort, but he still led the Dolphins in receptions, receiving yards and targets on the afternoon. The 2021 first-round pick has unsurprisingly seen an uptick in involvement during the first two full games Miami has played without Tyreek Hill (IR, knee), posting a combined 12-205-1 receiving line on 17 targets in that pair of contests. Waddle's clear-cut No. 1 receiver role should persist in a Week 7 road matchup against a talented Browns defense.",
      "updated_at": "2025-10-14 18:29:10.860449"
    },
    {
      "player_name": "Jaylen Wright",
      "team": "MIA",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860447"
    },
    {
      "player_name": "Julian Hill",
      "team": "MIA",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hill drew the same target total as top tight end Darren Waller (2-12-1) during Sunday's loss. While Waller figures to more consistently see the higher target share at the TE position going forward and dominate high-value looks, Hill has benefited from an increased role the wake of the season-ending injury suffered by Tyreek Hill (IR, knee). That said, Miami's passing game figures to have a tough time producing on the road against the Browns in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860447"
    },
    {
      "player_name": "Malik Washington",
      "team": "MIA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Washington remains consistently involved on offense, having drawn five targets in four of his six regular-season appearances to begin the year, and he's also been involved as a ball-carrier in all but one game. That said, Washington hasn't done much with those opportunities, as he's yet to score or log a 50-yard performance on offense this season. He'll have a difficult task improving his efficiency on the road against a stingy Browns defense in Week 7. In fantasy formats that reward production on special teams, however, Washington carries sneaky upside, as he racked up 153 yards on five kickoff returns versus Los Angeles.",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "Nick Westbrook-Ikhine",
      "team": "MIA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Westbrook-Ikhine played a 37 percent of offensive snaps versus Los Angeles, but he finished with zero receiving yards for the third time in his last four appearances. Even with Tyreek Hill (IR, knee) out for the year, Westbrook-Ikhineappears to still be an afterthought on offense for the Dolphins, with all of Jaylen Waddle, Malik Washington, tight end Darren Waller and running back De'Von Achane clearly positioned above him. Westbrook-Ikhine figures to remain in a reserve role on the road against Cleveland in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "Ollie Gordon II",
      "team": "MIA",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Gordon once again struggled to display efficiency while operating as the Dolphins' top reserve backfield option, while starter De'Von Achane gashed Los Angeles with 16 carries for 128 rushing yards (8.0 YPC) and two scores, adding four grabs for 22 yards in the receiving game (six targets). At this stage, Gordon retains fantasy value purely as a handcuff in deeper formats, as his availability has rendered Jaylen Wright a healthy scratch. The rookie sixth-round pick faces a rough matchup on the road against Cleveland in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "Quinn Ewers",
      "team": "MIA",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "Tua Tagovailoa",
      "team": "MIA",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tagovailoa's turnover issues persisted in the narrow loss, although the last of his three interceptions came on a last-gasp play to close out the contest. The 2020 first-round pick's first two INTs were much more ill-timed, as Tagovailoa short-circuited drives at the Chargers' 39-yard line and his own 37, which led to 10 points for Los Angeles. Tagovailoa did lead Miami to two fourth-quarter touchdown drives and capped the second one off with a seven-yard scoring toss to Darren Waller with 46 seconds remaining, but he also undeniably played a direct part in the Dolphins falling to 1-5. Tagovailoa's Week 7 matchup is far from ideal in terms of his quest to atone for the turnover-filled performance, as a road trip to Cleveland to face the Browns' aggressive defense awaits.",
      "updated_at": "2025-10-14 18:29:10.860448"
    },
    {
      "player_name": "Adam Thielen",
      "team": "MIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Thielen has become a distant No. 4 receiver the past two games with the return of Jordan Addison from a suspension. He's unlikely to have a larger role in the offense unless one of the top three receivers is injured.",
      "updated_at": "2025-10-14 18:29:10.860450"
    },
    {
      "player_name": "Ben Yurosek",
      "team": "MIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860449"
    },
    {
      "player_name": "Cam Akers",
      "team": "MIN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Akers played just one offensive snap during the Vikings' 21-17 win over the Browns on Sunday, but he made the most of that opportunity by throwing a 32-yard pass to Josh Oliver on a trick play in which the sixth-year running back was used as a wildcat quarterback. Akers has already been elevated to Minnesota's active roster three times, which is the maximum allowed for a season. He would have to be signed to the active roster in order to play for the Vikings for the rest of the season.",
      "updated_at": "2025-10-14 18:29:10.860450"
    },
    {
      "player_name": "Carson Wentz",
      "team": "MIN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Shoulder",
      "description": "Wentz contended with soreness in his non-throwing shoulder during the Vikings' Oct. 6 win over the Browns in London, but he was able to finish out the contest. He appears to have made some progress in his recovery over the Vikings' Week 7 bye, though it won't be clear until Wednesday whether he's participating in practice as a full participant. J.J. McCarthy (ankle) also returned to practice Monday for the first time since Sept. 14, so even if his shoulder proves to be a non-issue, Wentz may move to the bench for Sunday's game against the Eagles after starting in each of the previous three games. The Vikings will likely gauge the health of McCarthy and Wentz throughout the week of practice before announcing a starter for Sunday.",
      "updated_at": "2025-10-14 18:29:10.860449"
    },
    {
      "player_name": "J.J. McCarthy",
      "team": "MIN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ankle",
      "description": "While head coach Kevin O'Connell has not named a starting quarterback for Sunday's game against the Eagles, he previously said McCarthy would need a full week of practice in order to gain clearance to play. Meanwhile Carson Wentz was also able to practice Monday, despite nursing a sore non-throwing shoulder. If McCarthy is able to practice without major limitations all week, he could return to the starting job.",
      "updated_at": "2025-10-14 18:29:10.860449"
    },
    {
      "player_name": "Jalen Nailor",
      "team": "MIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Nailor started opposite Justin Jefferson with Jordan Addison benched for the first quarter for disciplinary reasons. It didn't result in a significant increase in playing time, as Nailor played on 42 of the offense's 65 snaps, about the same percentage as last week. Nailor will continue to operate as the No. 3 receiver when the Vikings face the Eagles in Week 7 after a bye.",
      "updated_at": "2025-10-14 18:29:10.860450"
    },
    {
      "player_name": "Jordan Addison",
      "team": "MIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kevin Seifert of ESPN.com reported Addison was subject to a first-quarter benching for undisclosed reasons, but the third-year wideout ultimately would make up for lost time in clutch fashion. Addison was efficient with his opportunities, and the bulk of those came at the tail end of the Vikings' game-winning drive late in the fourth quarter. Addison was on the receiving end of each of Carson Wentz's final three completions and totaled 21 yards on those catches, the last which was a go-ahead 12-yard touchdown grab. For his part, Addison conceded afterward that he wasn't sure if he'd even be able to play in the game, per Seifert, but he made good on his vow to be ready if he did step on the field. Following the completion of his season-opening three-game suspension, Addison has immediately played a key part in Minnesota's air attack with a 9-155-1 line on 14 targets over his first two contests. He'll now prepare to play his first 2025 game stateside following the Week 6 bye when the Vikings host the Eagles on Sunday, Oct. 19 in a contest that could also provide Addison his first regular-season opportunity to work with J.J. McCarthy (ankle) as his quarterback.",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "Jordan Mason",
      "team": "MIN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Mason's rushing opportunities were limited, but he locked in a solid fantasy day with a three-yard touchdown run to cap off the first drive of the second half. The offseason addition generally found tough sledding on the ground outside of the short score and his game-long 14-yard run, but he continued to keep Minnesota's ground attack viable in the ongoing absence of Aaron Jones (IR, hamstring). Mason should be in line to remain the lead back when the Vikings come out of the Week 6 bye with a Week 7 home matchup against the Eagles on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "Josh Oliver",
      "team": "MIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Oliver's touchdown came on a trick play from Cam Akers in the wildcat formation. Oliver has just four receptions and six targets in five games this season. He's almost exclusively a blocking tight end but can get the occasional touchdown (two this season).",
      "updated_at": "2025-10-14 18:29:10.860450"
    },
    {
      "player_name": "Justin Jefferson",
      "team": "MIN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jefferson paced the Vikings in receptions, receiving yards and targets on the day, turning in his second consecutive 100-yard effort in the process. His final reception of the contest was especially critical, as he came down with a 21-yard grab to take the ball to the Browns' 27 yard-line with under two minutes remaining on Minnesota's game-winning drive. Jefferson has displayed excellent chemistry with fill-in signal-caller Carson Wentz over the last pair of contests, but J.J. McCarthy (ankle) may be set to return to action when the Vikings come out of a Week 6 bye to host the Eagles on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "T.J. Hockenson",
      "team": "MIN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The veteran tight end continued to play a short-area role and finished as the runner-up in receptions for the Vikings while also tying for second in targets. Hockenson provided some key contributions on the Vikings' game-winning drive late in the fourth quarter, making two catches for 20 yards during the possession. He has between four and six receptions in his last three games, but he's yet to top 49 receiving yards in any contest this season heading into the Week 6 bye.",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "Zavier Scott",
      "team": "MIN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Scott played on 14 of the offense's 65 snaps and was the clear No. 2 running back ahead of Cam Akers (one snap on offense). Scott's fumble could put his No. 2 running back role at risk, but it doesn't appear Akers is a significant threat. However, Scott may have just one more game as the backup if Aaron Jones (hamstring) is able to return from injured reserve Week 8.",
      "updated_at": "2025-10-14 18:29:10.860450"
    },
    {
      "player_name": "Austin Hooper",
      "team": "NE",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With just two catches on as many targets for 29 yards over his last three games, Hooper is off the fantasy radar as long as fellow TE Hunter Henry remains in the Patriots' lineup.",
      "updated_at": "2025-10-14 18:29:10.860452"
    },
    {
      "player_name": "DeMario Douglas",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The third-year wideout nearly had a much bigger performance, but Douglas had a 61-yard TD in the first quarter erased by a very questionable offensive pass interference call away from the play on Stefon Diggs. The call didn't cost the Patriots any points, however, as Drake Maye capped that drive with a 25-yard score to Kayshon Boutte instead. Douglas had just 30 receiving yards on the season coming into Sunday, but two of his 10 receptions have resulted in touchdowns. Douglas remains behind Diggs and Boutte in the pecking order for targets, but he'll carry some momentum into a Week 7 tilt against the Titans.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Drake Maye",
      "team": "NE",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The second-year QB was sharp right from the coin toss, hitting DeMario Douglas and Kayshon Boutte for long TDs in the first quarter before adding another 29-yard score to Boutte just before halftime right after New Orleans had taken a 16-14 lead. Maye has tossed multiple touchdowns in four of the last five games, posting an impressive 9:1 TD:INT over that stretch and leading New England to three straight wins. He'll look to keep rolling in Week 7 against the Titans.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Efton Chism III",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Sunday's contest represented the regular-season debut for Chism, who made his mark while logging 12 special teams snaps and returned five kickoffs for 129 yards. The rookie wideout could keep the primary kickoff returner role with Antonio Gibson out for the season due to a torn ACL.",
      "updated_at": "2025-10-14 18:29:10.860452"
    },
    {
      "player_name": "Hunter Henry",
      "team": "NE",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Through six games, Henry has maintained steady playing time while recording a 20-277-3 receiving line on 31 targets. Though his volume has tapered off over his last three outings, the tight end remains a viable red-zone option for QB Drake Maye and a candidate to see increased targets on any given week, when game script and/or game flow dictate.",
      "updated_at": "2025-10-14 18:29:10.860452"
    },
    {
      "player_name": "Kayshon Boutte",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "While his target volume was modest, it was Boutte's biggest share since Week 1, and he led the Patriots in receptions and receiving yards Sunday while hauling in scores of 25 and 29 yards from Drake Maye in the first half. Boutte will take an 18-301-3 line on 23 targets this season into a Week 7 clash with the Titans, and with Maye seemingly headed for a breakout campaign, the third-year wideout's fantasy value may be on the upswing.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Kyle Williams",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie wideout didn't record a catch despite being targeted twice. Through six games, Williams has caught just two passes on four targets for 20 yards, and while his role could grow as the season progresses, for now he remains behind Stefon Diggs, Kayshon Boutte, Mack Hollins and DeMario Douglas in the Patriots' WR pecking order.",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "Mack Hollins",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Through the Patriots' first six contests, Hollins has turned in a 9-70-2 receiving line on 12 targets. As this coming Sunday's game against the Titans approaches, Hollins is only a fantasy consideration in deep formats.",
      "updated_at": "2025-10-14 18:29:10.860452"
    },
    {
      "player_name": "Rhamondre Stevenson",
      "team": "NE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The fifth-year RB avoided committing another fumble, but that was about the only silver lining to his performance. Stevenson has failed to reach 40 rushing yards in four straight games, producing a woeful 2.7 YPC over that stretch, and only a couple Week 5 rushing TDs have salvaged any real fantasy value for him during that span. TreVeyon Henderson hasn't had much more success, so the duo will likely continue to work in a timeshare in Week 7 against the Titans.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Stefon Diggs",
      "team": "NE",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The veteran wideout wasn't able to follow up on his revenge game against the Bills last week, as Drake Maye instead looked for Kayshon Boutte (5-93-2 on five targets) and DeMario Douglas (3-71-1 on four targets) with his downfield throws Sunday. Diggs has a respectable 32 catches for 387 yards on 37 targets through six games, but he's still looking for his first TD of 2025. Diggs will try to hit paydirt in Week 7 against the Titans.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Tommy DeVito",
      "team": "NE",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860451"
    },
    {
      "player_name": "TreVeyon Henderson",
      "team": "NE",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The results were meager, but Henderson still out-gained Rhamondre Stevenson by 18 scrimmage yards, although he finished one rushing yard behind quarterback Drake Maye for the team lead. Henderson has yet to reach even 40 rushing yards or 60 scrimmage yards in a game this season, and the rookie will likely remain stuck in a timeshare with Stevenson heading into a Week 7 clash with the Titans.",
      "updated_at": "2025-10-14 18:29:10.860453"
    },
    {
      "player_name": "Alvin Kamara",
      "team": "NO",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "After dealing with an ankle injury during the week in practice, Kamara didn't seem particularly bothered by the issue as he saw at least 15 touches for the fourth time in the last five games and  produced 70-plus scrimmage yards for the third time in that span. Kamara has 314 rushing yards and a 22-122-0 receiving line on 26 targets through six contests, but a Week 1 rushing TD has been his only trip to the end zone so far. He'll look to end his scoring drought in Week 7 against the Bears.",
      "updated_at": "2025-10-14 18:29:10.860455"
    },
    {
      "player_name": "Brandin Cooks",
      "team": "NO",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Cooks logged a season low in targets for the second week in a row. The 32-year-old has served as the Saints' No. 3 wideout this season, but his production has looked more like that of a WR4, as he's averaged 2.2 catches on 2.8 targets for 20.7 yards per game. His fantasy numbers should remain negligible so long as Chris Olave, Rashid Shaheed and TE1 Juwan Johnson are healthy moving forward. His next opportunity will come during the Week 7 matchup versus the Bears on Sunday, Sept. 19.",
      "updated_at": "2025-10-14 18:29:10.860454"
    },
    {
      "player_name": "Chris Olave",
      "team": "NO",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The fourth-year wideout nearly produced his first 100-yard performance since Week 8 of last season, but Olave instead had to settle for a season high in receiving yards. He's been Spencer Rattler's favorite downfield option by far, seeing double-digit targets in five of six games to begin the campaign en route to a 39-342-1 line on 63 targets overall. Olave will look to stay productive in Week 7 against the Bears.",
      "updated_at": "2025-10-14 18:29:10.860454"
    },
    {
      "player_name": "Juwan Johnson",
      "team": "NO",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Johnson suited up after dealing with an ankle issue during practice for the second week in a row. The 29-year-old also logged exactly two catches for the second straight contest, as he recorded season lows in targets and receiving yards. The lowlight of Johnson's performance came on his second catch when he coughed up a fumble in the fourth quarter. Johnson went from averaging 9.7 targets per game over the first three weeks to averaging 3.0 over the last three weeks. This downturn in opportunities has coincided with the overall decrease in passing attempts for the Saints across the last three games, so it appears his dropoff in production may continue so long as the New Orleans offense eases its reliance on Spencer Rattler's arm. Johnson will look to grab more passes during the Week 7 contest versus Chicago on Sunday, Sept. 19.",
      "updated_at": "2025-10-14 18:29:10.860454"
    },
    {
      "player_name": "Kendre Miller",
      "team": "NO",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "After back-to-back games with double-digit carries, Miller was stonewalled for his second-least efficient rushing performance of the season. The third-year running back has now averaged 7.6 carries per game this season. Over the last three games, he's averaging 9.6 rushing attempts for 42.3 yards per contest while operating as the No. 2 running back behind Alvin Kamara. Miller will look to remain involved in his backup role during the Week 7 matchup versus the Bears on Sunday, Sept. 19.",
      "updated_at": "2025-10-14 18:29:10.860454"
    },
    {
      "player_name": "Rashid Shaheed",
      "team": "NO",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The speedy wideout  has caught exactly four passes in five straight games, but Sunday's yardage total was his lowest of the season. Shaheed remains dependent on deep throws for significant fantasy value, but with Spencer Rattler getting more confident and comfortable in coach Kellen Moore's offense, connections like last week's 87-yard TD could become more frequent. Shaheed may have a better chance of making an impact in Week 7 against the Bears.",
      "updated_at": "2025-10-14 18:29:10.860454"
    },
    {
      "player_name": "Spencer Rattler",
      "team": "NO",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The second-year QB didn't commit a turnover for the fifth time in six starts to begin the season, but Rattler also wasn't able to produce a touchdown as the Saints had to settle for four Blake Grupe field goals, as well as a one-yard TD run from Taysom Hill. Rattler's 8.7 YPA on Sunday was a season high, as were his 227 passing yards. He'll take a 6:1 TD:INT into a Week 7 matchup against the Bears.",
      "updated_at": "2025-10-14 18:29:10.860455"
    },
    {
      "player_name": "Beaux Collins",
      "team": "NYG",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Giants were playing without wideouts Malik Nabers (knee, out for the season) and Darius Slayton (hamstring) on Thursday, so there was some expectation that Collins would be asked to step into a bigger role. Instead, he logged only four offensive snaps while practice-squad elevation Lil'Jordan Humphrey worked as New York's No. 2 wideout with a 77 percent snap share. Jalin Hyatt (29 offensive snaps) was also above Collins in the pecking order, and the latter's participation level was his lowest since he played exclusively on special teams in Week 2 versus Dallas. With that in mind, Collins doesn't appear to be moving up the Giants' depth chart even given the team's injuries at the wideout position, so he's probably not worth a roster spot in almost all fantasy formats.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Daniel Bellinger",
      "team": "NYG",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "In a Week 5 loss to New Orleans, Bellinger broke out with a season-high and team-leading 52 receiving yards on four catches. That led to an expectation that he would be significantly involved on offense in Week 6 with New York depleted at the wideout position, per Jordan Raanan of ESPN.com, but things didn't shake out that way. While Bellinger did log a healthy 57 percent snap share, he never had a pass thrown his way during a game in which New York leaned heavily on its ground game. Meanwhile, No. 1 tight end Theo Johnson caught two of four targets for 27 yards and logged a 90 percent snap share. Though Bellinger has caught every one of his targets so far this season, that's resulted in a very modest 7-85-0 receiving line through six contests.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Darius Slayton",
      "team": "NYG",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860455"
    },
    {
      "player_name": "Devin Singletary",
      "team": "NYG",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Singletary continued to get a bit of work even with the return of Tyrone Tracy to New York's backfield, but neither Singletary nor Tracy did anything of note. Meanwhile, rookie Cam Skattebo continued to cement his status as the team's workhorse back with 19 carries for 98 yards and three touchdowns along with two catches for 12 yards. Skattebo was on the field for 71 percent of the Giants' offensive plays, followed by Tracy at 30 percent and Singletary at a modest six percent (four total snaps). Given that usage, it appears Singletary will fade back into the No. 3 RB role when both Skattebo and Tracy are healthy, giving the veteran very little fantasy value.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Jalin Hyatt",
      "team": "NYG",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With Malik Nabers (knee) out for the season and Darius Slayton (hamstring) inactive for Week 6, Hyatt by default was called upon for a bigger role. Hyatt still put up a modest stat line, though he did reel in catches on back-to-back plays during a second-quarter drive that ultimately ended in a touchdown. However, Hyatt was out-snapped by a 53-29 margin by practice-squad elevation Lil'Jordan Humphrey, who finished with a 4-55-0 line on a team-leading eight targets. That's not a good sign of New York's level of faith in Hyatt, who could fade further out of the picture if Slayton is able to return to action Week 7 against Denver.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Jameis Winston",
      "team": "NYG",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860455"
    },
    {
      "player_name": "Jaxson Dart",
      "team": "NYG",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Dart recorded the first signature win of his nascent career with a standout, mistake-free performance. The dynamic rookie got off to a blistering start by helping lead two first-quarter touchdown drives, possessions he capped off with a 20-yard scoring run and a 35-yard strike to Wan'Dale Robinson. Dart went on to lead three more scoring drives in the upset, and he navigated a brief third-quarter exit to be checked for a concussion to finish out the upset victory without incident. Dart has already shown considerable promise in his first three starts while recording a pair of victories in the process. but he'll get quite the test in a Week 7 road matchup against the Broncos on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860457"
    },
    {
      "player_name": "Lil'Jordan Humphrey",
      "team": "NYG",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With Malik Nabers (knee) and Darius Slayton (hamstring) injured, Humphrey started Thursday night against the Eagles and played 77 percent of the offensive snaps, finishing with four catches for 55 yards on eight targets in his first regular-season action of 2025. Humphrey figures to be a regular elevation candidate over the next few weeks after his strong Week 6 performance.",
      "updated_at": "2025-10-14 18:29:10.860455"
    },
    {
      "player_name": "Theo Johnson",
      "team": "NYG",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Johnson had flashed with a season-high six receptions and a pair of touchdowns in the Week 5 loss to the Saints on Sunday, but he was a lot quieter four days later despite the Giants' successful night on offense. Nevertheless, he finished with at least four targets for the third straight game, and he appears to have a solid rapport with rookie signal-caller Jaxson Dart heading into a challenging Week 7 road matchup against the Broncos on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Tyrone Tracy Jr.",
      "team": "NYG",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tracy returned from a two-game absence due to a shoulder injury but ceded the vast majority of backfield opportunities to Cam Skattebo, who turned 21 touches into 110 yards from scrimmage and three touchdowns. Tracy was on the field for 21 offensive snaps compared to only four for Devin Singletary, but Skattebo led the backfield with 49 snaps in addition to getting the lion's share of rushing opportunities. With Skattebo finding success in a workhorse role, Tracy likely will be relegated to a change-of-pace role moving forward.",
      "updated_at": "2025-10-14 18:29:10.860456"
    },
    {
      "player_name": "Wan'Dale Robinson",
      "team": "NYG",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Robinson's catch and yardage totals were both team highs for the Giants on the night, and his target tally was second only to that of Lil'Jordan Humphrey. The highlight of Robinson's night was his 35-yard touchdown reception in the first quarter, his second score of the campaign. Robinson now has seen seven targets apiece in his first two full games without Malik Nabers (IR, knee), and his involvement should remain elevated during a tough Week 7 road matchup against the Broncos on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860457"
    },
    {
      "player_name": "Allen Lazard",
      "team": "NYJ",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Personal",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860457"
    },
    {
      "player_name": "Arian Smith",
      "team": "NYJ",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith had one deep ball thrown his way, but Justin Fields failed to connect with the rookie speedster. That wasn't a surprising outcome considering Fields threw for only 45 yards in the game. Smith could get more involved in the offense against the Panthers in Week 7 if Garrett Wilson (knee) sits out or is limited.",
      "updated_at": "2025-10-14 18:29:10.860458"
    },
    {
      "player_name": "Breece Hall",
      "team": "NYJ",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hall's workload was his largest of the season yet, as the Broncos and Jets engaged in a slugfest where pass protection was at a premium for Justin Fields, who was sacked nine times. Turning to Hall didn't yield particularly encouraging dividends for New York, however, as Denver's talented defense held the running back to a long run of eight yards. Hall had come in on an encouraging two-game stretch where he'd amassed 194 yards on 28 carries against the suspect defenses of the Dolphins and Cowboys, but the notable increase in the caliber of competition Sunday served to neutralize him. Hall and the Jets get an easier assignment in their return stateside, as the Panthers will pay a visit to MetLife Stadium next Sunday for a Week 7 interconference clash.",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Garrett Wilson",
      "team": "NYJ",
      "position": "WR",
      "injury_status": "Doubtful",
      "practice_status": "",
      "body_part": "Knee",
      "description": "Confirmation from the team has yet to come, but at a minimum it looks like the Jets are in line to be without their top pass catcher this weekend against the Panthers. If that's the case, Josh Reynolds, Arian Smith, Allen Lazard (personal) and Tyler Johnson would be candidates to see added WR reps in Wilson's absence.",
      "updated_at": "2025-10-14 18:29:10.860457"
    },
    {
      "player_name": "Isaiah Davis",
      "team": "NYJ",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Davis saw typical backup running back usage, playing on 15 of the Jets' 57 snaps on offense compared to Breece Hall's 42. It would take an injury to Hall for Davis to carve out meaningful fantasy value for the winless Jets.",
      "updated_at": "2025-10-14 18:29:10.860458"
    },
    {
      "player_name": "Jelani Woods",
      "team": "NYJ",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860458"
    },
    {
      "player_name": "Jeremy Ruckert",
      "team": "NYJ",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Ruckert reverted to being a non-factor in the passing game after a four-catch outing in Week 5 against the Cowboys. He was on the field for 22 of the Jets' 57 snaps on offense. Ruckert should continue to work behind Mason Taylor in Week 7against the Panthers.",
      "updated_at": "2025-10-14 18:29:10.860458"
    },
    {
      "player_name": "Josh Reynolds",
      "team": "NYJ",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The veteran wideout accounted for more than half of Justin Fields' paltry 45 passing yards on the day while tying for the team lead in receptions and setting the pace in targets. Reynolds now has back-to-back three-catch efforts following a two-game absence due to a hamstring injury and a Week 4 blanking in his return, but until the Jets are able to put together a semblance of a consistent passing attack, his fantasy outlook will remain relatively bleak.",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Justin Fields",
      "team": "NYJ",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Coach Aaron Glenn admitted Monday that Fields, who completed just nine of 17 pass attempts for 45 yards while absorbing nine sacks, \"took a step back\" in Sunday's 13-11 loss to the Broncos in London, but the current plan is to stick with the 26-year-old under center. Behind Fields on the depth chart are 36-year-old Tyrod Taylor, who is a known commodity as a reliable veteran backup at this stage of his career, and undrafted rookie Brady Cook on the practice squad. Taylor isn't a long-term answer, and Cook likely isn't ready for regular-season NFL action. Things could change if Fields doesn't rebound and show signs of improvement.",
      "updated_at": "2025-10-14 18:29:10.860457"
    },
    {
      "player_name": "Khalil Herbert",
      "team": "NYJ",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Mason Taylor",
      "team": "NYJ",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Just one week after posting a career-best 9-67-0 line on 12 targets, Taylor nearly pulled a complete disappearing act in Sunday's low-scoring loss. However, the rookie tight end was hardly the only Jets pass catcher to experience a forgettable afternoon, considering Justin Fields threw for just 45 yards and was sacked nine times. The Week 7 outlook for the entire offense is much brighter, however, as New York welcomes in the Panthers to MetLife Stadium for a Week 7 matchup next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Tyler Johnson",
      "team": "NYJ",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Justin Fields threw for just 45 yards, so Johnson unsurprisingly failed to get involved in the low-scoring loss. Even if Garrett Wilson (knee) were to sit out Week 7 against the Panthers, Johnson's upside would be capped due to Fields' struggles throwing the ball.",
      "updated_at": "2025-10-14 18:29:10.860458"
    },
    {
      "player_name": "A.J. Brown",
      "team": "PHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "This comes with the territory for a big market team that's the defending Super Bowl champs, but the drama surrounding the Eagles' key offensive players has been exhausting. However, it's prudent to remember how the Eagles' offense was also off-kilter at this point in the season last year, too.",
      "updated_at": "2025-10-14 18:29:10.860460"
    },
    {
      "player_name": "AJ Dillon",
      "team": "PHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Dillon received his first two targets of the year, but overall his workload remained minimal. He's yet to receive more than three touches or see the field for more than 10 offensive snaps in a game this season.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "Dallas Goedert",
      "team": "PHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Goedert led the Eagles across the board in receptions, receiving yards and targets with those marks, and his game-best 36-yard catch also qualified as a season-high figure. The veteran tight end has scored all five of his touchdowns this season over the last four games, and that tally ties a career best for Goedert, who also recorded the same number of trips to the end zone in 2019. With 20 targets in his last two games alone, Goedert will remain a highly viable option in all formats during a Week 7 road matchup against the Vikings on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "DeVonta Smith",
      "team": "PHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith was third across the board to Dallas Goedert and A.J. Brown in receptions, receiving yards and targets on the night, and his overall numbers represented a significant downturn from his season-best effort against the Broncos on Sunday. Smith recorded exactly half of the receptions and targets he had in that contest, while his yardage tally was a sharp decline from the 114 he managed versus Denver. His first opportunity to bounce back will come against the Vikings in a Week 7 road matchup on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "Grant Calcaterra",
      "team": "PHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Oblique",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Jahan Dotson",
      "team": "PHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "One catch has become Dotson's typical stat line for the Eagles. He's finished with exactly one reception in four of six games this season and finished with exactly one catch in eight regular-season games last year.",
      "updated_at": "2025-10-14 18:29:10.860460"
    },
    {
      "player_name": "Jalen Hurts",
      "team": "PHI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Hurts and the Eagles offense had a productive first quarter when they netted 10 points as a unit, and the reigning Super Bowl MVP connected with Dallas Goedert from three yards out late in the period for six of those. Hurts would add a one-yard touchdown run at just under the seven-minute mark of the second quarter, and that would surprisingly be the end of the scoring on the night for Philadelphia. Hurts exceeded 30 pass attempts for a second consecutive contest for the first time this season, and he averaged a season-best 8.6 yards per attempt Thursday while connecting with six different targets. The sixth-year pro's one interception also was very costly, however, as it came at the Giants' nine-yard line early in the fourth quarter with the Eagles down 10 and was returned all the way to Philadelphia's 23-yard line to set up the New York's game-clinching touchdown. Hurts has hit or exceeded 280 passing yards in each of the last two games heading into a Week 7 road showdown against the Vikings on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "John Metchie III",
      "team": "PHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Despite trailing for the entirety of the second half, the Eagles rarely put enough wide receivers on the field for Metchie, the fourth wideout on the depth chart, to see any action. He now has a total of four catches across his first six games with the team.",
      "updated_at": "2025-10-14 18:29:10.860460"
    },
    {
      "player_name": "Kylen Granson",
      "team": "PHI",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Despite seeing his most extensive playing time of the season, Granson went without a look in the passing game for the third game in a row. Granson still looks like a strong candidate to match or exceed last week's 36 percent snap share in this Thursday's game against the Giants. The Eagles are expected to be without Grant Calcaterra (oblique) for Week 6, leaving Granson as the clear top backup to top tight end Dallas Goedert.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "Sam Howell",
      "team": "PHI",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860459"
    },
    {
      "player_name": "Saquon Barkley",
      "team": "PHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Barkley was set up well on paper for a matchup against the Giants' porous run defense, but game script would eventually cap his opportunities and lead to his second-lowest carry total of the campaign. He was efficient with his opportunities, averaging an encouraging 4.8 yards per carry after posting 5.0 yards per tote in the Week 5 loss to the Broncos. Barkley has still to crack the 90-yard mark on the ground through six games, however, and he's still averaging just 3.4 yards per carry on the season thanks to a slow start to the season. Barkley will have a tough Week 7 challenge on his hands as well, considering the talented Vikings defense awaits in a Week 7 road matchup on Sunday, Oct. 19.",
      "updated_at": "2025-10-14 18:29:10.860461"
    },
    {
      "player_name": "Tank Bigsby",
      "team": "PHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bigsby hasn't played a single offensive snap since being acquired by the Eagles after Week 1. He's the fourth running back on the Eagles' depth chart, so even an injury to Saquon Barkley likely wouldn't be enough for him to move into a meaningful role.",
      "updated_at": "2025-10-14 18:29:10.860462"
    },
    {
      "player_name": "Will Shipley",
      "team": "PHI",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Shipley hasn't been a significant part of the offense at any point this season for the Eagles, but Thursday represented his season-low snap count. He did not touch the ball on offense but did return one kick for 22 yards.",
      "updated_at": "2025-10-14 18:29:10.860460"
    },
    {
      "player_name": "Xavier Gipson",
      "team": "PHI",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860460"
    },
    {
      "player_name": "Aaron Rodgers",
      "team": "PIT",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Rodgers had one of his better showings of the season, completing five passes of at least 20 yards. Four of those went to DK Metcalf, including a 25-yard touchdown down the right sideline to begin the fourth quarter. Rodgers has had a mixed start to his tenure with the Steelers, though he's averaged over 7.5 yards per attempt in three of five games this season, with Sunday also marking his third multi-touchdown performance of the campaign.",
      "updated_at": "2025-10-14 18:29:10.860463"
    },
    {
      "player_name": "Ben Skowronek",
      "team": "PIT",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Although Calvin Austin (shoulder) was sidelined for Pittsburgh's Week 6 matchup Sunday, Skowronek played most of his snaps on special teams and wasn't involved in the passing game. Skowronek has been targeted just once over the Steelers' last four games, and he has minimal fantasy value, even if Austin is forced to miss more time.",
      "updated_at": "2025-10-14 18:29:10.860463"
    },
    {
      "player_name": "Calvin Austin III",
      "team": "PIT",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Shoulder",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860462"
    },
    {
      "player_name": "DK Metcalf",
      "team": "PIT",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Metcalf remained Aaron Rodgers' top target, leading the team in targets and yards. All four of his catches went for 20 yards or more, highlighted by a 25-yard score down the right sideline to kick off the fourth quarter. Even with an additional missed opportunity for a long touchdown due to an underthrow by Rodgers, Metcalf has found the end zone in each of his last four games and has topped 80 receiving yards in three of five contests to begin his tenure with the Steelers.",
      "updated_at": "2025-10-14 18:29:10.860464"
    },
    {
      "player_name": "Darnell Washington",
      "team": "PIT",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Washington continues to emerge in the Pittsburgh offense, as he led the tight end corps in targets and receiving yards. His involvement began immediately, as he recorded a 36-yard reception on the first play from scrimmage. Washington later chipped in gains of 12 and 14 yards, both of which came primarily after the catch. The end result was Washington's best yardage total of his career, and he seems to have surpassed Jonnu Smith and Pat Freiermuth for targets in the Pittsburgh offense.",
      "updated_at": "2025-10-14 18:29:10.860463"
    },
    {
      "player_name": "Jaylen Warren",
      "team": "PIT",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Warren returned from a one-game absence caused by a knee injury with his role in question due to competition from Kenneth Gainwell. Warren comfortably led the team with 11 carries, though he gave up a considerable amount of work to Gainwell in the receiving game. He was efficient with his work, but Warren appears to be the leader of a committee in Pittsburgh rather than a true lead back for the time being.",
      "updated_at": "2025-10-14 18:29:10.860464"
    },
    {
      "player_name": "Jonnu Smith",
      "team": "PIT",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith was on the field for just 25 percent of the Steelers' offensive snaps in Week 4, but he saw a much larger workload following the team's Week 5 bye. He played 69 percent of the team's offensive snaps against Cleveland, which still lagged behind Darnell Washington's 80 percent, but it signaled that Smith appears to have moved past the hip injury that plagued him before the bye. Over Smith's first five appearances of the season, he's secured 17 of 20 targets for 89 yards and a touchdown.",
      "updated_at": "2025-10-14 18:29:10.860462"
    },
    {
      "player_name": "Kaleb Johnson",
      "team": "PIT",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Johnson saw six carries during the Steelers' Week 4 win over the Vikings, and he saw a similar workload following Pittsburgh's Week 5 bye. Jaylen Warren continues to serve as the team's clear lead back, but Johnson has seen slightly more opportunities over the past two games. The 22-year-old's 11 offensive snaps still lagged behind Warren (31) and Kenneth Gainwell (20), and Johnson's fantasy value will likely remain limited as long as those two remain healthy.",
      "updated_at": "2025-10-14 18:29:10.860463"
    },
    {
      "player_name": "Ke'Shawn Williams",
      "team": "PIT",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Williams joined the Steelers' practice squad in late August after failing to make the team's 53-man roster at the end of training camp. Though he hasn't been elevated this season, the undrafted rookie out of Indiana could make his NFL regular-season debut against the Browns on Sunday due to the absence of Calvin Austin (shoulder). Austin's absence opens the door for Williams to serve on special teams as a returner on kickoffs and punts.",
      "updated_at": "2025-10-14 18:29:10.860464"
    },
    {
      "player_name": "Kenneth Gainwell",
      "team": "PIT",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jaylen Warren served as Pittsburgh's lead back in a traditional sense, out-carrying Gainwell 11-6. However, Gainwell was more involved as a pass catcher, leading to a near-even split in total touches. Gainwell didn't make much of a case to further overtake Warren with an inefficient performance, but he appears to have a clear role in the Pittsburgh backfield for the time being.",
      "updated_at": "2025-10-14 18:29:10.860463"
    },
    {
      "player_name": "Pat Freiermuth",
      "team": "PIT",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Although Freiermuth recorded a catch Sunday after being held without a target during the Steelers' Week 4 win over Minnesota, he was on the field for just 36 percent of Pittsburgh's offensive snaps against Cleveland, which ranked third among the team's tight ends. Darnell Washington has taken on a larger role over the last two games, and Freiermuth seems to be behind Jonnu Smith as well following Pittsburgh's Week 5 bye. Over his last three games, Freiermuth has secured two of four targets for 17 yards.",
      "updated_at": "2025-10-14 18:29:10.860462"
    },
    {
      "player_name": "Roman Wilson",
      "team": "PIT",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Wilson was on the field for 15 offensive snaps Sunday, which was his highest mark since the Steelers' Week 2 loss to Seattle. Part of his uptick in playing time was likely due to Calvin Austin (shoulder) being sidelined. Although Wilson had a catch while racking up double-digit receiving yards for the first time this season, he has minimal fantasy value, even if Austin misses more time.",
      "updated_at": "2025-10-14 18:29:10.860462"
    },
    {
      "player_name": "AJ Barner",
      "team": "SEA",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Barner finished in the relatively unfamiliar position of second in receiving yardage and tied with Jaxon Smith-Njigba for the longest reception of the game. That catch covered a distance of 61 yards on the first play of Seattle's game-clinching drive, with Barner getting loose down the middle of the field after making the reception and taking the ball down to the Jaguars' 12-yard line. Barner has now set new single-game season highs in receiving yards in three consecutive contests, but he's typically much more of a shorter-area target for Sam Darnold and will remain a complementary pass-catching option in a tough Week 7 home matchup against the Texans on Monday night, Oct. 20.",
      "updated_at": "2025-10-14 18:29:10.860468"
    },
    {
      "player_name": "Cooper Kupp",
      "team": "SEA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Kupp got into the end zone for the first time as a member of the Seahawks, recording an 11-yard touchdown grab early in the third quarter. The veteran wideout remains a distant No. 2 in the offense's pecking order behind No. 1 receiver Jaxon Smith-Njigba, who had another prolific afternoon Sunday and has logged 56 targets to Kupp's 32. Kupp has now been under 60 receiving yards for four straight games heading into a challenging Week 7 home matchup against the Texans on Monday night, Oct. 20.",
      "updated_at": "2025-10-14 18:29:10.860468"
    },
    {
      "player_name": "Dareke Young",
      "team": "SEA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Young logged just four of the Seahawks' 61 offensive snaps, but he made a big impact during his time on the field, connecting with quarterback Sam Darnold on a deep ball early in the third quarter to set up an eventual Zach Charbonnet touchdown run. The Seahawks could continue to sprinkle Young into the offensive game as a downfield threat, but the 26-year-old projects to deliver most of his impact as a return man.",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Elijah Arroyo",
      "team": "SEA",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Arroyo continues to work as the No. 2 tight end behind AJ Barner, who has consistently played around 80 percent of the offensive snaps while producing 17 receptions for 205 yards and four touchdowns. Meanwhile, Arroyo has logged more than 50 percent of the snaps just once this season, and he has yet to catch more than two passes in a game. The rookie is an intriguing athlete who could still have a bright future in the league, but it will be difficult to depend on him for fantasy purposes until his usage improves.",
      "updated_at": "2025-10-14 18:29:10.860467"
    },
    {
      "player_name": "Jake Bobo",
      "team": "SEA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bobo has been targeted just once over his first five games, and he has averaged just 11.2 offensive snaps per game. As long as Jaxon Smith-Njigba, Cooper Kupp and rookie Tory Horton are healthy, Bobo won't have fantasy utility.",
      "updated_at": "2025-10-14 18:29:10.860467"
    },
    {
      "player_name": "Jalen Milroe",
      "team": "SEA",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Milroe would need starter Sam Darnold and backup Drew Lock to get injured, sick or ejected to have a chance to play. The Alabama product and 2025 third-round pick has yet to attempt a pass in his pro career.",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Jaxon Smith-Njigba",
      "team": "SEA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Smith-Njigba was in the familiar position of leading the Seahawks' air attack in receptions, receiving yards and targets, posting a new season high in the middle category along the way. His catch total also tied for second highest of the season, and he added three more grabs of 20-plus yards, the most prominent a 61-yard touchdown on a beautifully thrown ball from QB Sam Darnold. The third-year star now has back-to-back 100-yard tallies for the second time this season and takes a robust 42-696-3 receiving line into a Week 7 home matchup against the Texans on Monday night, Oct. 20.",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Kenneth Walker III",
      "team": "SEA",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Walker logged two fewer carries than Zach Charbonnet, but he outgained his teammate by 10 rushing yards, as neither back was particularly efficient during the defense-centric battle. The fourth-year pro's yardage total represented quite the downturn after he'd topped the 80-yard mark in each of the previous two games, and Charbonnet's workload is somewhat of a concern for the moment for Walker's fantasy managers. It remains to be seen if a similar timeshare will apply moving forward, but neither player has a particularly bright outlook for a Week 7 home matchup against a tough Texans defense on Monday night, Oct. 20.",
      "updated_at": "2025-10-14 18:29:10.860468"
    },
    {
      "player_name": "Nick Kallerup",
      "team": "SEA",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860467"
    },
    {
      "player_name": "Sam Darnold",
      "team": "SEA",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Darnold looked as impressive as usual outside the friendly confines of Lumen Field, averaging 10.9 yards per attempt as he remained aggressive downfield. The veteran signal-caller once again focused the majority of his attention on Jaxon Smith-Njigba, who ended up on the receiving end of half of Darnold's completions and 162 of his yards, not to mention one of his two touchdowns, a perfectly thrown 61-yard strike in the second quarter. Darnold added a nifty 11-yard scoring toss to Cooper Kupp in the fourth quarter, and he'll head into a Week 7 home clash with the Texans on Monday night, Oct. 20 having thrown for multiple touchdowns in four of the last five games.",
      "updated_at": "2025-10-14 18:29:10.860468"
    },
    {
      "player_name": "Tory Horton",
      "team": "SEA",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Horton scored three offensive touchdowns over the previous four games, but he failed to catch a pass for the first time since Week 1 in this outing. The passing game continues to rely heavily on Jaxon Smith-Njigba, and with Cooper Kupp still healthy, Horton's usage likely will remain volatile moving forward. The rookie remains relevant on special teams, where he has returned 11 punts for 171 yards and a touchdown.",
      "updated_at": "2025-10-14 18:29:10.860467"
    },
    {
      "player_name": "Zach Charbonnet",
      "team": "SEA",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "As made clear by his rushing line, Charbonnet found virtually no running room against a talented Jaguars front seven, and he actually gained 10 fewer rushing yards on two more carries than backfield mate Kenneth Walker. Sunday marked Charbonnet's fourth game with a sub-4.0-yards-per-carry figure this season, so outside of his occasional rushing touchdowns, the third-year back's fantasy outlook remains stagnant heading into a tough Week 7 home matchup against the Texans on Monday night, Oct. 20.",
      "updated_at": "2025-10-14 18:29:10.860468"
    },
    {
      "player_name": "Brandon Aiyuk",
      "team": "SF",
      "position": "WR",
      "injury_status": "Out",
      "practice_status": "",
      "body_part": "Knee - ACL + MCL",
      "description": "Aiyuk remains in recovery mode from the ACL and MCL tears that he suffered in his right knee Week 7 of last season, instead residing on the reserve/PUP list to this point in the campaign. Per David Lombardi of SFStandard.com, Shanahan added, \"I always look around Week 10, but I'm not putting an exact date on it.\" As of Week 6, Aiyuk's only notable on-field work occurred in mid-September, when he was seen running while fellow 49ers wide receivers worked in individual drills, per Wagoner.",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Brian Robinson Jr.",
      "team": "SF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was an odd usage game for Robinson after he did not receive a carry for the first time in six appearances this year. Equally abnormal, the veteran backup's three targets Sunday matched the combined total from his previous five contests. The end result was still unsavory from a fantasy perspective, as Robinson was unable to do much with just five snaps played on offense (seven percent). Fantasy managers shouldn't expect much from Robinson in games that starter Christian McCaffrey is healthy for. The same can be said for next Sunday's tilt against the Falcons.",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Brock Purdy",
      "team": "SF",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Toe",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860464"
    },
    {
      "player_name": "Christian McCaffrey",
      "team": "SF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McCaffrey scored his first regular-season touchdown since the 2023 campaign after being held out of the end zone as a runner over his previous five starts this year and all four healthy appearances in 2024. The dual-threat superstar has been in the doldrums as a pure rusher this season (3.1 YPC), but he has offset that with WR1 production as a receiver (46-444-3). In fact, CMC has finished with more receiving yards than rushing yards in five of his six starts this year, highlighting a peculiar start to his game logs. Fantasy managers could care less how their workhorse gets his numbers so long as the overall production is elite, as it has been all season. McCaffrey will likely be asked to continue shouldering the load for the 49ers' offense against the Falcons on Sunday Night Football in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860466"
    },
    {
      "player_name": "Demarcus Robinson",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Robinson was demoted to No. 4 on the 49ers' depth chart with the return of Jauan Jennings (ribs) to the starting lineup Sunday. The 30-year-old Robinson still finished with his highest yardage total since joining San Francisco this past offseason after breaking off a 31-yard reception in the second quarter. Robinson only logged 13 snaps (19 percent) for a shorthanded offense Sunday, a concerning trend for a player who was expected to step into a larger role with his new club. The veteran wideout makes for a risky play in Week 7 against the Falcons with such a limited role.",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Jake Tonges",
      "team": "SF",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tonges continued doing his best George Kittle (hamstring) impression in another effective spot-start Sunday. The 25-year-old Tonges has been a pleasant surprise in fantasy during his brief run as the starter, posting a 25-223-3 receiving line through six games. David Lombardi of SFStandard.com reported that Kittle could return from injured reserve in Week 7, which would effectively end Tonges' run of utility. Managers should wait until Kittle is officially activated before making any rash decisions regarding Tonges in Week 7 and onward.",
      "updated_at": "2025-10-14 18:29:10.860466"
    },
    {
      "player_name": "Jauan Jennings",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Ribs",
      "description": "Jennings missed Week 5 against the Rams with the injury but returned to the lineup Sunday against Tampa Bay. However, he was almost nonexistent in the box score, finishing with just one catch for seven yards as an afterthought in the passing game. Jennings didn't look anywhere near 100 percent health. Kendrick Bourne turned in another stellar performance, securing five of nine targets for 142 yards as Mac Jones' preferred go-to option. Jennings will be hard to trust in fantasy lineups next Sunday against Atlanta.",
      "updated_at": "2025-10-14 18:29:10.860466"
    },
    {
      "player_name": "Jordan James",
      "team": "SF",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie fifth-rounder has yet to see regular-season action and will be a healthy scratch for a fifth consecutive game. Christian McCaffrey, Brian Robinson and Isaac Guerendo will serve as the 49ers' active running backs for Sunday's road tilt.",
      "updated_at": "2025-10-14 18:29:10.860467"
    },
    {
      "player_name": "Jordan Watkins",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Calf",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860464"
    },
    {
      "player_name": "Kendrick Bourne",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Fresh off posting a career-best 142 receiving yards against the Rams in Week 5, Bourne likely made his managers double take at the box score after hitting that same mark in consecutive contests. The 29-year-old has shown great chemistry with old teammate Mac Jones, as the former Patriots continue to post video-game numbers filling in for injured 49ers starters in 2025. Bourne continued starting in place of Ricky Pearsall (knee) while Jauan Jennings (ribs) returned in a limited capacity but revealed that he was playing with five broken ribs after the contest. If Pearsall is forced to miss a third consecutive game in Week 7, then Bourne's stock would remain elevated for next Sunday's tilt against the Falcons.",
      "updated_at": "2025-10-14 18:29:10.860466"
    },
    {
      "player_name": "Mac Jones",
      "team": "SF",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jones toughed out a pair of injuries and another week of limited practices in order to start for a shorthanded 49ers squad Sunday. The veteran backup was unable to earn his fourth win in as many appearances with San Francisco, but he did produce a season-high 347 passing yards for fantasy managers. The Alabama product is averaging a whopping 313.0 yards per game with a 2:1 TD:INT in place of starter Brock Purdy (toe/shoulder) this season. The latter's status is currently unclear for Week 7, but Jones has certainly played well enough in Purdy's stead to warrant fantasy consideration if he remains under center against the Falcons for Sunday Night Football.",
      "updated_at": "2025-10-14 18:29:10.860466"
    },
    {
      "player_name": "Marquez Valdes-Scantling",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Valdes-Scantling wound up playing 42 snaps (61 percent) on offense while serving as the No. 3 receiver against Tampa Bay. The 30-year-old more than doubled his entire season production with Sunday's output, which highlights his lack of usage through six weeks. Valdes-Scantling will look to stay involved against the Falcons next Sunday, but there is little to see from a fantasy perspective.",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Ricky Pearsall",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee - PCL",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Skyy Moore",
      "team": "SF",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Moore reverted to primarily operating as the 49ers' punt and kick returner after recording at least one target or one carry over his previous three appearances. The 24-year-old has just one reception for 10 yards in six appearances this season, leaving no room for fantasy utility. The song remains the same for Moore in next Sunday's tilt against Atlanta.",
      "updated_at": "2025-10-14 18:29:10.860465"
    },
    {
      "player_name": "Baker Mayfield",
      "team": "TB",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Mayfield produced a sterling 139.0 passer rating against a 49ers defense that was helpless after losing LB Fred Warner (ankle) early in the contest. The Buccaneers also suffered a key loss early on when WR Emeka Egbuka (hamstring) exited the game after recording just two receptions. This meant that Mayfield had to finish off the win sans his three top weapons, with Mike Evans (hamstring) and Chris Godwin (fibula) in street clothes Sunday. The 30-year-old Mayfield overcame expectations and produced his fifth multi-score game through six starts. With the Buccaneers visiting the Lions on Monday Night Football in Week 7, it will be important for fantasy managers to note which receivers Mayfield will have at his disposal before making roster decisions.",
      "updated_at": "2025-10-14 18:29:10.860471"
    },
    {
      "player_name": "Bucky Irving",
      "team": "TB",
      "position": "RB",
      "injury_status": "Doubtful",
      "practice_status": "",
      "body_part": "Shoulder",
      "description": "doubtful",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Cade Otton",
      "team": "TB",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Otton paced the Buccaneers in targets and receptions while finishing with his second-highest yardage total of the season. Part of the reason the tight end was featured so prominently Sunday was the early departure of star rookie Emeka Egbuka. Otton remained scoreless through six starts, but he is getting involved downfield more often as Tampa Bay deals with injuries at the wideout position. Otton will look to build a hot streak with another strong showing against the Lions next Monday.",
      "updated_at": "2025-10-14 18:29:10.860470"
    },
    {
      "player_name": "Chris Godwin Jr.",
      "team": "TB",
      "position": "WR",
      "injury_status": "Doubtful",
      "practice_status": "",
      "body_part": "Lower Leg",
      "description": "doubtful",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Emeka Egbuka",
      "team": "TB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "Egbuka secured two of four targets for 24 yards before being forced out Sunday, a contest in which the Buccaneers were missing Mike Evans (hamstring) and Chris Godwin (fibula), as well as top running back Bucky Irving (shoulder). It would be a significant blow for the offense if Egbuka is unable to return for a road Monday Night Football matchup against the Lions in Week 7, as the rookie phenom has racked up a 25-445-5 line on 38 targets. With Egbuka, Evans and Godwin all uncertain to play, Sterling Shepard, Tez Johnson, Kameron Johnson and tight end Cade Otton could be positioned as Baker Mayfield's top receiving options versus Detroit.",
      "updated_at": "2025-10-14 18:29:10.860470"
    },
    {
      "player_name": "Josh Williams",
      "team": "TB",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Concussion",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860469"
    },
    {
      "player_name": "Mike Evans",
      "team": "TB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860470"
    },
    {
      "player_name": "Rachaad White",
      "team": "TB",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "White got the nod in place of injured starter Bucky Irving (foot/shoulder) for the second consecutive week, rewarding fantasy managers with his third touchdown over that span. The 26-year-old White finished below four yards per carry in both spot-starts, but his nose for the goal line helped cement another strong fantasy score. No. 3 RB Sean Tucker (6-25-1) remained a distant second in carries behind White, but the former was able to vulture a touchdown from the fill-in starter this time around. The Buccaneers have an extra day off before hosting the Lions on Monday Night Football in Week 7, so White's managers should monitor Irving's availability leading up to that contest before deciding whether to deploy White in their lineups.",
      "updated_at": "2025-10-14 18:29:10.860471"
    },
    {
      "player_name": "Sean Tucker",
      "team": "TB",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Tucker made his mark on the box score when he took a nine-yard scamper for an easy touchdown in Sunday's victory. Rachaad White (17-6-1) made the most of Bucky Irving's (foot/shoulder) second missed game of the season, producing the superior fantasy line in the process. Even if Irving remains sidelined in Week 7, Tucker won't check in any higher than second on Tampa Bay's depth chart against the Lions next Monday.",
      "updated_at": "2025-10-14 18:29:10.860470"
    },
    {
      "player_name": "Sterling Shepard",
      "team": "TB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Shepard was elevated to second on the receiver depth chart after Mike Evans (hamstring) and Chris Godwin (fibula) were ruled out for Sunday's tilt. Things could have opened up more for the veteran after Emeka Egbuka (hamstring) left the contest early, but it was fellow wideouts Kameron Johnson and Tez Johnson who cashed in a pair of Baker Mayfield passing touchdowns Sunday. While things didn't pan out for Shepard in Week 6 (given his elevated opportunities), Egbuka's potential absence moving forward means that Shepard is worth holding for next Monday's tilt against the Lions.",
      "updated_at": "2025-10-14 18:29:10.860471"
    },
    {
      "player_name": "Teddy Bridgewater",
      "team": "TB",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860471"
    },
    {
      "player_name": "Tez Johnson",
      "team": "TB",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The Buccaneers entered the game without Mike Evans (hamstring) and Chris Godwin (fibula), and they then lost Emeka Egbuka to a hamstring injury during the contest. That led to Johnson playing a career-high 38 snaps (72 percent), and he showed off his signature speed on his one reception to catch up to a Baker Mayfield bomb on a post late in the third quarter for his first career touchdown. The rookie could be set for even more work in a Week 7 road showdown against the Lions next Monday night if the team's wide-receiver depth chart remains as atrophied as it is in the immediate wake of Week 6.",
      "updated_at": "2025-10-14 18:29:10.860470"
    },
    {
      "player_name": "Bryce Oliver",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Knee",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860471"
    },
    {
      "player_name": "Calvin Ridley",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Hamstring",
      "description": "Ridley thus ends his day with one catch (on one target) for 18 yards, while Elic Ayomanor, Chimere Dike, Tyler Lockett and Van Jefferson will handle the Titans' WR duties in his absence for the remainder of the contest. Ridley's next chance to see game action will arrive Oct. 19 against the Patriots.",
      "updated_at": "2025-10-14 18:29:10.860473"
    },
    {
      "player_name": "Cam Ward",
      "team": "TEN",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Ward had Tennessee's offense in shambles out of the gates Sunday, leading six first-half drives that resulted in four punts and two turnovers (both charged to Ward). The rookie signal-caller finally woke up in the fourth quarter, but a third and final turnover thwarted any plans for a comeback. Ward managed to end a scoreless drought lasting two weeks, but he still has more interceptions thrown (four) than touchdowns (three) through six starts. The Titans are looking like a work in progress in Ward's first season as a pro, so fantasy managers should look for safer options in Week 7.",
      "updated_at": "2025-10-14 18:29:10.860473"
    },
    {
      "player_name": "Chig Okonkwo",
      "team": "TEN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Okonkwo's six targets Sunday tied his previous season high, while the six grabs set a new high-water mark through six starts. Aside from a one-catch dud in Week 4, the veteran tight end has carved out a consistent role in the passing game. Okonkwo will carry a 23-218-0 receiving line into next Sunday's tilt against the Patriots.",
      "updated_at": "2025-10-14 18:29:10.860473"
    },
    {
      "player_name": "Chimere Dike",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "It was a mixed performance for Dike, who recorded a career-best 54 percent offensive snap rate. However, he earned only three targets and was inefficient with the opportunity. Dike has now been held to single-digit yards from scrimmage in five of six games this season.",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Elic Ayomanor",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Ayomanor produced his third underwhelming performance in a row as the Titans returned to their losing ways in 2025. The lack of production from the rookie is especially concerning considering that No. 1 wideout Calvin Ridley (hamstring) left the contest early and did not return. Van Jefferson (4-75-0) wound up taking advantage instead and finished as Tennessee's leading receiver. That said, if Ridley is forced to miss next Sunday's tilt against the Patriots, Ayomanor may have a prime opportunity to return to the form that made him a hot pickup early in the campaign.",
      "updated_at": "2025-10-14 18:29:10.860473"
    },
    {
      "player_name": "Gunnar Helm",
      "team": "TEN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Helm saw a slight downturn in snap rate relative to his Week 5 performance, as he was on the field for only 49 percent of offensive snaps. He still managed to earn three targets, but was less involved than veteran tight end Chig Okonkwo. Helm remains inconsistent, though he could see his role expand as the Titans turn their attention to developing Cam Ward and auditioning players for a role in 2026.",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Julius Chestnut",
      "team": "TEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Chestnut was on the field for only three offensive snaps while slipping to third on the Tennessee depth chart due to the return of Tyjae Spears. Chestnut has not attempted more than two carries in a game this season.",
      "updated_at": "2025-10-14 18:29:10.860474"
    },
    {
      "player_name": "Thomas Odukoya",
      "team": "TEN",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Tony Pollard",
      "team": "TEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Pollard finished with his worst fantasy score of the season in a seemingly promising matchup against the Raiders defense. The veteran starter still led Tennessee's backfield with 10 carries, finishing five ahead of backup Tyjae Spears. Pollard's reduced touches were rather the result of a poor game script as opposed to a changing of the guard in Tennessee's backfield. Fantasy managers should continue treating Pollard as a potential flex option against the Patriots next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860473"
    },
    {
      "player_name": "Tyjae Spears",
      "team": "TEN",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Spears more than doubled his total touches in his second game back from an ankle injury. Tony Pollard (10-34-0) still spearheaded the Titans' backfield, but the gap in touch distribution inched even closer Sunday. The speedy backup will continue vying for more snaps against the Patriots next Sunday.",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Tyler Lockett",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Lockett's snap rate remained depressed for the second straight game, as he was on the field for only 32 percent of offensive snaps. He was still targeted three times, though his lone catch went for no gain. Lockett has posted at least 10 receiving yards in a game only once this season.",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Van Jefferson",
      "team": "TEN",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Jefferson recorded more offensive yardage in Week 6 than during the prior five games his year combined, as he played a season-high 75 percent of the offensive snaps. His increased involvement came as the result of Calvin Ridley (hamstring) being forced off the field early in the first quarter. If Ridley is limited or unable to play in Week 7 versus the Patriots then Jefferson, rookie fourth-rounder wideout Elic Ayomanor and tight end Chig Okonkwo could all benefit from an uptick in target share.",
      "updated_at": "2025-10-14 18:29:10.860472"
    },
    {
      "player_name": "Chris Rodriguez Jr.",
      "team": "WAS",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Rodriguez had played between 15 and 22 offensive snaps in each of the previous three games since Austin Ekeler's season-ending torn Achilles suffered in Week 2. Against Chicago, however, the Commanders simplified their backfield with Jacory Croskey-Merritt handling early-down duties and Jeremy McNichols as the clear pass-catching back. Rodriguez carries extremely minimal fantasy value at the moment.",
      "updated_at": "2025-10-14 18:29:10.860474"
    },
    {
      "player_name": "Deebo Samuel",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Samuel wasn't at 100 percent, and although Jayden Daniels kept him involved, the veteran receiver couldn't do much with his opportunities. Samuel posted his second-lowest receiving yardage total of the season, but his injury seemed to play a role. The seven-year pro will look to get healthier ahead of a key Week 7 road matchup against the Cowboys on Sunday.",
      "updated_at": "2025-10-14 18:29:10.860475"
    },
    {
      "player_name": "Ja'Corey Brooks",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Brooks and Tay Martin have both been elevated Monday to provide depth at wide receiver, as both Terry McLaurin (quadriceps) and Noah Brown (groin/knee) have been ruled out versus Chicago, while Deebo Samuel (heel) is officially listed as questionable but is expected to suit up. At 6-foot-5, Brooks could offer Washington a formidable red-zone target. The undrafted rookie wideout out of Louisville spent the offseason with the Commanders.",
      "updated_at": "2025-10-14 18:29:10.860476"
    },
    {
      "player_name": "Jacory Croskey-Merritt",
      "team": "WAS",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "The rookie seventh-round pick was coming off a career-best performance Week 5 against the Chargers, but he surprisingly found tough sledding on the ground against a Bears defense that has struggled to contain the run. Croskey-Merritt's late-first-quarter fumble also was costly, as he lost the ball at his own 33-yard line and saw the Bears score a touchdown on a Caleb Williams one-yard run five plays later. Despite the miscue, Croskey-Merritt remained the clear lead option in the ground attack, as No. 2 back Jeremy McNichols recorded just two carries. Croskey-Merritt's outlook for Week 7 remains bright, as a road matchup with the porous Cowboys defense is on tap Sunday.",
      "updated_at": "2025-10-14 18:29:10.860475"
    },
    {
      "player_name": "Jayden Daniels",
      "team": "WAS",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "As his collection of numbers indicates, it was a mixed bag of a night for Daniels in his second game back from a knee sprain that cost him a pair of contests. The second-year signal-caller threw a season-high three touchdown passes, connecting with Chris Moore (22 yards), Luke McCaffrey (33 yards) and Zach Ertz (six yards) to erase 13-0 and 16-10 deficits. However, Daniels' first-quarter interception, his first of the season, led to a Bears field goal, and his fumble at Chicago's 45-yard line on an attempted handoff to Jacory Croskey-Merritt with 3:10 remaining and Washington clinging to a two-point lead would eventually result in a game-winning field goal by opposing kicker Jake Moody. Daniels also took three sacks, and this was his first multi-turnover tally of the season. The star quarterback and his teammates don't have time to dwell on the last-second defeat, however, as a road date with the arch-rival Cowboys awaits Sunday afternoon.",
      "updated_at": "2025-10-14 18:29:10.860475"
    },
    {
      "player_name": "Jaylin Lane",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "With Terry McLaurin (quadriceps) and Noah Brown (groin/knee) continuing to miss time, Lane saw an elevated role on offense, playing 42 percent of the snaps. He also returned one punt for nine yards on special teams. On the season, the fourth-round rookie has seven grabs for 82 scoreless yards on 15 targets and 13 punt returns for 186 yards and one touchdown.",
      "updated_at": "2025-10-14 18:29:10.860474"
    },
    {
      "player_name": "Jeremy McNichols",
      "team": "WAS",
      "position": "RB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McNichols played 32 percent of the offensive snaps and set new season-highs in targets, catches and receiving yards against the Bears. The Commanders appear to have settled on Jacory Croskey-Merritt as the lead ball-carrier on early downs with McNichols as the passing-down back, as Chris Rodriguez played just one offensive snap and didn't touch the ball Monday night.",
      "updated_at": "2025-10-14 18:29:10.860474"
    },
    {
      "player_name": "John Bates",
      "team": "WAS",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Bates likely tweaked his shoulder during the Commanders' Week 5 win over the Chargers. He opened the week as a limited practice participant Thursday, but his ability to participate without restrictions Friday indicates that he should be good to go against the Bears on Monday. Bates played 41 snaps (30 on offense, 11 on special teams) and caught his first pass of the regular season for nine yards in Week 5.",
      "updated_at": "2025-10-14 18:29:10.860476"
    },
    {
      "player_name": "Josh Johnson",
      "team": "WAS",
      "position": "QB",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Johnson has fluctuated between being the backup and third-string quarterback in Washington based on the health of Jayden Daniels. With Daniels set to start in Week 6, Johnson will be inactive for the second consecutive week.",
      "updated_at": "2025-10-14 18:29:10.860476"
    },
    {
      "player_name": "Luke McCaffrey",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "McCaffrey got wide open down the left side of the field in the third quarter for his touchdown, erasing a 16-10 deficit in the process. The second-year wideout also had a splash play on his only catch in Week 5 against the Chargers, with that reception covering a season-high 50 yards. Despite his obvious big-play potential, McCaffrey has notably seen only three targets over the last two games with both Terry McLaurin (quadriceps) and Noah Brown (groin, knee) missing from those contests, keeping his fantasy value limited to deep leagues and large-field DFS tournaments in a Week 7 road matchup against the Cowboys on Sunday.",
      "updated_at": "2025-10-14 18:29:10.860475"
    },
    {
      "player_name": "Noah Brown",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Groin",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860475"
    },
    {
      "player_name": "Tay Martin",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Martin will be elevated for a third consecutive game, meaning that to suit up for any further regular-season contests for the Commanders, the team will have to sign him to the active roster. In both of his prior appearances Martin drew exactly one target, but he could see expanded opportunities on Monday versus Chicago with both Terry McLaurin (quadriceps) and Noah Brown (groin/knee) ruled out, and Deebo Samuel (heel) expected to play through injury.",
      "updated_at": "2025-10-14 18:29:10.860476"
    },
    {
      "player_name": "Terry McLaurin",
      "team": "WAS",
      "position": "WR",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "Quadriceps",
      "description": "questionable",
      "updated_at": "2025-10-14 18:29:10.860474"
    },
    {
      "player_name": "Zach Ertz",
      "team": "WAS",
      "position": "TE",
      "injury_status": "Questionable",
      "practice_status": "",
      "body_part": "",
      "description": "Following a Week 5 blanking at the hands of the Chargers, Ertz enjoyed a noteworthy resurgence in Monday's narrow loss. The veteran tight end led the Commanders in receptions and targets while checking in behind only Chris Moore in receiving yards. Ertz also posted his first touchdown since Week 2 on a six-yard scoring grab early in the fourth quarter, rounding out an encouraging night that also saw him tie a season high in receptions. He should have a good chance at carrying over his momentum into Week 7, as he'll face the Cowboys' vulnerable defense on the road.",
      "updated_at": "2025-10-14 18:29:10.860475"
    }
  ]
}